darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
#include "WebServerModule.h"
#include "Version.h"
#include <stdint.h>   // INT32_MIN используется в _handleBackupRestore
#if defined(ESP8266)
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
using WebServerCompat = ESP8266WebServer;
#else
#include <WebServer.h>
#include <WiFi.h>
using WebServerCompat = WebServer;
#endif
#include <ArduinoJson.h>   // ArduinoJson v6 — установить через Library Manager
#include "Memory.h"
#include "Connectivity.h"  // для ntp_sync_time()
#include "Logger.h"
#include "RTC_Module.h"    // для rtc_now() — last-visit timestamp
#include "Battery.h"       // для калибровки делителя через /api/battery/calib (v5.0.19)
#ifdef USE_SD_CARD
#include <SPI.h>
#include <SD.h>
#include <LittleFS.h>
#elif defined(ESP8266)
#include <LittleFS.h>
#define LOG_FS LittleFS
#elif defined(ESP32)
#include <SPIFFS.h>
#define LOG_FS SPIFFS
#endif

static WebServerCompat _srv(WEB_SERVER_PORT);
static WebData    _wd;
static WebActions _wa;

// ─── CSRF-токен (32 hex-символа, ротируется при каждой перезагрузке) ─────
static char _csrfToken[33] = {0};
static void _csrf_init() {
  if (_csrfToken[0] != '\0') return;
#if defined(ESP8266) || defined(ESP32)
  uint32_t r1 = ESP.getCycleCount() ^ micros();
  uint32_t r2 = millis() ^ (uint32_t)random(0x7FFFFFFF);
#else
  uint32_t r1 = micros();
  uint32_t r2 = millis();
#endif
  snprintf(_csrfToken, sizeof(_csrfToken), "%08lx%08lx%08lx%08lx",
           (unsigned long)r1, (unsigned long)r2,
           (unsigned long)(r1 ^ 0xDEADBEEF), (unsigned long)(r2 ^ 0xCAFEBABE));
}

// ─── Basic Auth проверка (credentials из EEPROM) ─────────────────────────
static bool _auth() {
  char u[24], p[32];
  get_admin_user(u, sizeof(u));
  get_admin_pass(p, sizeof(p));
  if (!_srv.authenticate(u, p)) {
    _srv.requestAuthentication();
    return false;
  }
  return true;
}

// ─── CSRF проверка для state-changing запросов (POST) ────────────────────
// Токен ожидается в заголовке X-CSRF-Token. Клиент получает его через /api/data.
static bool _csrf_check() {
  if (_csrfToken[0] == '\0') _csrf_init();
  String hdr = _srv.header("X-CSRF-Token");
  if (hdr.length() != 32 || strcmp(hdr.c_str(), _csrfToken) != 0) {
    _srv.send(403, "application/json",
              "{\"ok\":false,\"msg\":\"CSRF token missing or invalid\"}");
    return false;
  }
  return true;
}

// ─── Rate limit для дорогих GET-эндпоинтов (1 сек) ───────────────────────
static bool _rate_limit(unsigned long &lastReq, unsigned long minMs) {
  unsigned long now = millis();
  if (lastReq != 0 && (now - lastReq) < minMs) {
    _srv.send(429, "application/json",
              "{\"ok\":false,\"msg\":\"Rate limited\"}");
    return false;
  }
  lastReq = now;
  return true;
}

// ─── Главная HTML страница (хранится во Flash) ────────────────────────────
static const char PAGE_HTML[] PROGMEM = R"rawhtml(
<!DOCTYPE html><html lang="ru"><head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>🐝 BeehiveScale</title>
<link rel="manifest" href="/manifest.json">
<meta name="theme-color" content="#f5a623">
<meta name="apple-mobile-web-app-capable" content="yes">
<meta name="apple-mobile-web-app-status-bar-style" content="black-translucent">
<meta name="apple-mobile-web-app-title" content="Beehive">
<link rel="apple-touch-icon" href="/icon.svg">
<link rel="icon" type="image/svg+xml" href="/icon.svg">
<style>
*{box-sizing:border-box;margin:0;padding:0}
:root{
  --bg:#0d0f0b;--panel:#141710;--border:#2e3829;
  --amber:#f5a623;--amber2:#ffd166;--green:#6fcf97;
  --red:#eb5757;--blue:#56ccf2;--text:#c8d4b8;--text2:#a5b894;--text3:#a5b894;
  --mono:'Courier New',monospace;
}
body{background:var(--bg);color:var(--text);font-family:var(--mono);font-size:15px;min-height:100vh}
a{color:var(--amber);text-decoration:none}

.refresh-bar{height:2px;background:var(--border);position:fixed;top:0;left:0;right:0;z-index:200}
.refresh-fill{height:100%;background:var(--amber);transition:width 0.5s linear}

.hdr{background:rgba(20,23,16,.97);border-bottom:1px solid var(--border);padding:8px 24px;position:sticky;top:0;z-index:99;min-height:52px;display:flex;align-items:center;justify-content:center}
.hdr-inner{display:flex;flex-direction:column;align-items:center;gap:0;position:relative;z-index:1}
.hdr-logo{font-size:18px;font-weight:700;letter-spacing:3px;color:var(--amber);text-align:center}
.hdr-sub{font-size:10px;color:var(--text3);letter-spacing:2px}
.hdr-right{position:absolute;left:62%;top:50%;transform:translateY(-50%);
  display:flex;align-items:center;gap:14px;font-size:13px;color:var(--text3)}
.live{display:inline-block;width:7px;height:7px;border-radius:50%;
  background:var(--green);box-shadow:0 0 5px var(--green);animation:pulse 2s infinite;margin-right:5px}
@keyframes pulse{0%,100%{opacity:1}50%{opacity:.3}}

.tabs{display:flex;border-bottom:1px solid var(--border);
  background:rgba(20,23,16,.9);position:sticky;top:52px;z-index:98;overflow-x:auto;
  justify-content:center;padding:0;
  -webkit-overflow-scrolling:touch;scrollbar-width:thin}
.tab{padding:10px 18px;font-size:13px;letter-spacing:1px;color:var(--text3);
  border-bottom:2px solid transparent;cursor:pointer;white-space:nowrap;text-transform:uppercase;
  background:none;border-top:none;border-left:none;border-right:none;font-family:var(--mono);
  flex-shrink:0}
.tab:hover{color:var(--text2)}
.tab.active{color:var(--amber);border-bottom-color:var(--amber)}
/* Мобильная адаптация: табы становятся скроллируемыми с выравниванием от начала */
@media (max-width:760px){
  .tabs{justify-content:flex-start;padding:0 8px}
  .tab{padding:10px 12px;font-size:12px;letter-spacing:.5px}
  .hdr{padding:8px 12px;flex-wrap:nowrap;justify-content:space-between;gap:8px}
  .hdr-inner{align-items:flex-start;flex:0 1 auto}
  .hdr-logo{font-size:15px;display:flex;flex-direction:column;align-items:flex-start;gap:2px}
  .hdr-logo #fw-ver{margin-left:0 !important;font-size:11px;color:var(--text3)}
  .hdr-sub{display:none !important}
  .hdr-right{position:static;transform:none;left:auto;top:auto;font-size:11px;gap:8px;flex:0 0 auto;flex-direction:column;align-items:flex-end;text-align:right}
}

