darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
.section{display:none;padding:20px 24px;max-width:1080px;margin:0 auto;width:100%}
.section.active{display:block}

.grid{display:grid;grid-template-columns:1fr 1fr;gap:12px}
.grid-3{display:grid;grid-template-columns:1fr 1fr 1fr;gap:10px}
.grid-auto{display:grid;grid-template-columns:repeat(auto-fill,minmax(180px,1fr));gap:8px}
@media(max-width:700px){.grid,.grid-3{grid-template-columns:1fr}}

.card{background:var(--panel);border:1px solid var(--border);padding:14px;position:relative;overflow:hidden}
.card::before{content:'';position:absolute;top:0;left:0;right:0;height:2px;
  background:linear-gradient(90deg,var(--amber),transparent)}
.card.blue::before{background:linear-gradient(90deg,var(--blue),transparent)}
.card.green::before{background:linear-gradient(90deg,var(--green),transparent)}
.card.red::before{background:linear-gradient(90deg,var(--red),transparent)}
.card.full{grid-column:1/-1}
.card-title{font-size:13px;letter-spacing:1px;color:var(--text3);text-transform:uppercase;margin-bottom:12px;display:flex;align-items:center;justify-content:space-between}
.card-title span{cursor:pointer;color:var(--text3);font-size:12px}
.card-title span:hover{color:var(--amber)}

.val-big{font-size:42px;font-weight:700;color:var(--amber);line-height:1;letter-spacing:-1px}
.val-unit{font-size:18px;color:var(--text2);margin-left:3px}
.val-sub{font-size:13px;color:var(--text3);margin-top:6px;line-height:1.7}

.gauge-wrap{display:flex;align-items:center;gap:8px;margin-top:8px}
.gauge{flex:1;height:4px;background:var(--border)}
.gauge-fill{height:100%;background:var(--amber);transition:width .5s}
.gauge-lbl{font-size:13px;color:var(--text3);min-width:40px;text-align:right}

.status-row{display:flex;align-items:center;gap:8px;padding:6px 0;
  border-bottom:1px solid #1c2018;font-size:13px}
.status-row:last-child{border:none}
.dot{width:8px;height:8px;border-radius:50%;flex-shrink:0}
.dot.ok{background:var(--green);box-shadow:0 0 4px var(--green)}
.dot.err{background:var(--red);box-shadow:0 0 4px var(--red)}
.dot.warn{background:var(--amber);box-shadow:0 0 4px var(--amber)}
.status-lbl{flex:1;color:var(--text2)}
.status-val{color:var(--text);font-size:13px;text-align:right}

.btn{display:inline-flex;align-items:center;justify-content:center;font-family:var(--mono);
  font-size:12px;letter-spacing:1px;padding:9px 16px;border:1px solid;cursor:pointer;
  background:transparent;transition:all .15s;text-transform:uppercase;gap:6px}
.btn-amber{border-color:var(--amber);color:var(--amber)}
.btn-amber:hover{background:var(--amber);color:#000}
.btn-red{border-color:var(--red);color:var(--red)}
.btn-red:hover{background:var(--red);color:#fff}
.btn-green{border-color:var(--green);color:var(--green)}
.btn-green:hover{background:var(--green);color:#000}
.btn-blue{border-color:var(--blue);color:var(--blue)}
.btn-blue:hover{background:var(--blue);color:#000}
.btn:disabled{opacity:.4;cursor:not-allowed}
.btn:active{transform:scale(0.96)}
.btn-row{display:flex;gap:8px;flex-wrap:wrap;margin-top:10px}

.form-row{margin-bottom:12px}
.form-row label{display:block;font-size:12px;letter-spacing:0.8px;color:var(--text3);
  text-transform:uppercase;margin-bottom:5px}
input,select{background:#1c2018;border:1px solid var(--border);color:var(--text);
  font-family:var(--mono);font-size:13px;padding:9px 12px;outline:none;width:100%}
input:focus,select:focus{border-color:var(--amber)}
input[type=checkbox]{width:auto}

/* ── WiFi mode cards ── */
.wm-opts{display:flex;gap:8px;margin-bottom:12px}
.wm-opt{flex:1;background:#1c2018;border:1px solid var(--border);padding:14px 10px;cursor:pointer;
  display:flex;flex-direction:column;align-items:center;justify-content:center;text-align:center;gap:8px;min-height:130px;transition:border-color .15s}
.wm-opt:hover{border-color:var(--text3)}
.wm-opt.sel{border-color:var(--amber)}
.wm-opt input[type=radio]{accent-color:var(--amber)}
.wm-opt-body{font-size:13px;line-height:1.8;color:var(--text2);text-align:center}
.wm-opt-body b{color:var(--text);font-size:14px;display:block;margin-bottom:4px}
.wm-opt-body small{color:var(--text3);font-size:12px}

/* ── Pass change ── */
.pass-section{border-top:1px solid var(--border);padding-top:12px;margin-top:12px}
.pass-row{display:flex;gap:8px;align-items:flex-end}
.pass-row .form-row{flex:1;margin:0}
.pass-strength{height:3px;background:var(--border);margin-top:4px;transition:all .2s}

/* ── Chart ── */
.chart-container{position:relative;margin-bottom:10px}
.chart-svg{width:100%;height:100%;display:block;overflow:visible;touch-action:pan-y}
.chart-cursor{position:absolute;top:0;width:1.5px;background:var(--amber);pointer-events:none;z-index:5;display:none;opacity:.7}
.chart-dot{position:absolute;width:10px;height:10px;border-radius:50%;background:var(--amber);border:2px solid #fff;pointer-events:none;z-index:6;display:none;transform:translate(-50%,-50%);box-shadow:0 0 6px var(--amber)}
.period-tabs{display:flex;gap:4px;margin-bottom:8px;flex-wrap:wrap}
.period-btn{padding:5px 12px;font-size:12px;letter-spacing:1px;border:1px solid var(--border);
  background:transparent;color:var(--text3);cursor:pointer;font-family:var(--mono);text-transform:uppercase}
.period-btn.active{border-color:var(--amber);color:var(--amber)}
.series-btns{display:flex;gap:4px;flex-wrap:wrap}
.ser-btn{padding:5px 12px;font-size:12px;border:1px solid var(--border);background:transparent;
  color:var(--text3);cursor:pointer;font-family:var(--mono)}
.ser-btn.active{background:#1c2018}
.ser-btn.s-w.active{border-color:var(--amber);color:var(--amber)}
.ser-btn.s-t.active{border-color:var(--blue);color:var(--blue)}
.ser-btn.s-b.active{border-color:var(--green);color:var(--green)}

/* ── Tooltip ── */
.tip{position:absolute;display:none;background:rgba(13,15,11,.95);border:1px solid var(--border);
  padding:8px 12px;font-size:13px;pointer-events:none;z-index:50;line-height:1.5;min-width:140px;box-shadow:0 4px 12px rgba(0,0,0,.5)}

/* ── Export panel ── */
.exp-panel{background:#0f1209;border:1px solid var(--border);padding:12px;margin-top:10px;position:relative;z-index:10}
.exp-panel-title{font-size:12px;letter-spacing:2px;color:var(--text3);text-transform:uppercase;margin-bottom:10px}
.exp-cols{display:flex;flex-direction:column;gap:4px}
.exp-col-item{display:flex;align-items:center;gap:8px;font-size:13px;color:var(--text2);cursor:pointer}
.exp-col-item input{width:auto}
.exp-date-row{display:flex;gap:8px;margin-bottom:10px}
.exp-date-row .form-row{flex:1;margin:0}

/* ── API ── */
.api-grid{display:grid;grid-template-columns:repeat(auto-fill,minmax(200px,1fr));gap:6px;margin-top:8px}
.api-item{background:#1c2018;padding:10px 12px;border:1px solid var(--border);font-size:12px}
.api-method{font-weight:700;margin-bottom:2px}
.api-desc{color:var(--text3)}
.get{color:var(--green)}.post{color:var(--amber)}.del{color:var(--red)}

/* ── Info tiles ── */
.info-tile{background:#1c2018;border:1px solid var(--border);padding:8px 10px}
.info-tile .lbl{font-size:11px;color:var(--text3);letter-spacing:1px;margin-bottom:4px;text-transform:uppercase}
.info-tile .val{font-size:17px}

/* ── Calibration wizard ── */
.wiz-steps{display:flex;gap:0;margin-bottom:12px}
.wiz-step{flex:1;text-align:center;padding:6px 3px;font-size:11px;letter-spacing:.5px;
  border-bottom:2px solid var(--border);color:var(--text3);text-transform:uppercase}
.wiz-step.active{border-color:var(--amber);color:var(--amber)}
.wiz-step.done{border-color:var(--green);color:var(--green)}
.wiz-body{background:#1c2018;border:1px solid var(--border);padding:14px;min-height:80px;font-size:13px;line-height:1.8}

