darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
/* ── Toast ── */
.toast{position:fixed;bottom:16px;right:16px;z-index:500;font-family:var(--mono);font-size:11px;
  padding:10px 16px;border:1px solid var(--green);background:rgba(13,15,11,.97);color:var(--green);
  letter-spacing:1px;transform:translateX(220%);transition:transform .3s;max-width:280px}
.toast.show{transform:none}
.toast.err{border-color:var(--red);color:var(--red)}

/* ── Preview table ── */
.prev-wrap{overflow-x:auto;margin-top:10px}
.prev-table{width:100%;border-collapse:collapse;font-size:12px}
.prev-table th{background:#1c2018;color:var(--text3);padding:6px 10px;border:1px solid var(--border);
  text-align:left;font-weight:normal;letter-spacing:1px;text-transform:uppercase;font-size:11px}
.prev-table td{padding:5px 10px;border:1px solid var(--border);color:var(--text2)}
.prev-table tr:hover td{background:#1a1e15}

/* ── Wiz step bar ── */
.wiz-actions{display:flex;gap:8px;margin-top:10px;align-items:center}
.wiz-cur-w{font-size:13px;color:var(--text3);margin-left:auto}
</style>
</head>
<body>

<div class="refresh-bar"><div class="refresh-fill" id="rbar" style="width:100%"></div></div>

<div id="creds-warn" style="display:none;background:#3b1c18;border-bottom:2px solid var(--red);padding:10px 16px;text-align:center;color:var(--red);font-size:13px;letter-spacing:1px">
  ⚠ Используются стандартные учётные данные (admin/beehive). Смените пароль в разделе <a href="#" onclick="nav('wifi');return false" style="color:var(--amber);text-decoration:underline">Wi-Fi → Пароли и доступ</a>.
</div>

<div class="hdr">
  <div class="hdr-inner">
    <div class="hdr-logo">🐝 BeehiveScale <span id="fw-ver" style="font-size:12px;color:var(--text2);font-weight:400;margin-left:8px"></span></div>
  </div>
  <div class="hdr-right">
    <div class="hdr-sub" style="margin-right:16px">LIVE MONITOR · ESP32</div>
    <span><span class="live"></span>ONLINE</span>
    <span id="cur-time">--:--:--</span>
  </div>
</div>

<div class="tabs">
  <button class="tab active"  onclick="nav('main')">⌂ Главная</button>
  <button class="tab"         onclick="nav('archive')">📅 Архив</button>
  <button class="tab"         onclick="nav('chart')">📈 График + Экспорт</button>
  <button class="tab"         onclick="nav('wifi')">📶 Wi-Fi</button>
  <button class="tab"         onclick="nav('settings')">⚙ Настройки</button>
  <button class="tab"         onclick="nav('calib')">⚖ Калибровка</button>
  <button class="tab"         onclick="nav('tg')">✉ Telegram</button>
  <button class="tab"         onclick="nav('api')">🔌 API</button>
</div>

<!-- ═══════════════ MAIN ═══════════════ -->
<div class="section active" id="sec-main">
  <div class="card full" style="padding:10px 14px;margin-bottom:10px;display:flex;align-items:center;justify-content:space-between;gap:10px;flex-wrap:wrap">
    <div style="font-size:13px;color:var(--text2)">
      💤 Auto-sleep: <b id="ka-status" style="color:var(--amber)">обычный режим</b>
    </div>
    <button class="btn btn-blue" style="padding:8px 14px;font-size:13px" onclick="doKeepAlive()">☕ Продлить на 10 мин</button>
  </div>
  <div class="grid">

    <div class="card">
      <div class="card-title">⚖ Текущий вес</div>
      <div class="val-big" id="w-val">--<span class="val-unit">кг</span></div>
      <div class="val-sub" style="display:flex;flex-wrap:wrap;gap:4px 10px"><span style="white-space:nowrap">🎯 От зафикс. точки: <b id="w-ref">--</b> кг</span><span style="white-space:nowrap">Δ: <b id="w-delta" style="color:var(--amber2)">--</b> кг</span></div>
      <div class="val-sub" id="w-ref-date" style="font-size:12px;margin-top:2px"></div>
      <div class="val-sub" style="margin-top:4px">📈 С прошлого замера: <b id="w-period-delta" style="color:var(--green)">--</b> кг (было <b id="w-period-prev">--</b>)</div>
      <div class="gauge-wrap">
        <div class="gauge"><div class="gauge-fill" id="w-gauge" style="width:0%"></div></div>
        <div class="gauge-lbl" id="w-gpct">0%</div>
      </div>
    </div>

    <div class="card blue">
      <div class="card-title">🌡 Температура / Влажность</div>
      <div class="val-big" id="t-val">--<span class="val-unit">°C</span></div>
      <div class="val-sub">RTC: <b id="rtc-val">--</b>°C</div>
      <div class="gauge-wrap">
        <div class="gauge"><div class="gauge-fill" id="t-gauge" style="width:0%;background:var(--blue)"></div></div>
        <div class="gauge-lbl" id="t-gpct">--°C</div>
      </div>
    </div>

    <div class="card">
      <div class="card-title">🔋 Батарея</div>
      <div class="val-big" id="bat-v-big">--<span class="val-unit">В</span></div>
      <div class="val-sub">Заряд: <b id="bat-pct-v">--%</b></div>
      <div class="gauge-wrap">
        <div class="gauge"><div class="gauge-fill" id="bat-gauge" style="width:0%;background:var(--green)"></div></div>
        <div class="gauge-lbl" id="bat-gpct">--%</div>
      </div>
      <div class="card-title" style="margin-top:12px;font-size:11px;color:var(--text2)">💾 Лог / Память</div>
      <div class="val-sub">Занято: <b id="mem-used">--</b> КБ из <b id="mem-total">--</b> КБ</div>
      <div class="gauge-wrap">
        <div class="gauge"><div class="gauge-fill" id="mem-gauge" style="width:0%;background:var(--green)"></div></div>
        <div class="gauge-lbl" id="mem-gpct">--%</div>
      </div>
    </div>

    <div class="card">
      <div class="card-title">📡 Статус системы</div>
      <div class="status-row"><div class="dot warn" id="sr-dot"></div><div class="status-lbl">HX711 датчик</div><div class="status-val" id="sr-val">…</div></div>
      <div class="status-row"><div class="dot warn" id="wf-dot"></div><div class="status-lbl">Wi-Fi</div><div class="status-val" id="wf-val">…</div></div>
      <div class="status-row"><div class="dot ok"></div><div class="status-lbl">Веб-сервер</div><div class="status-val">Активен :80</div></div>
      <div class="status-row"><div class="dot ok" id="sd-dot"></div><div class="status-lbl">Хранилище лог</div><div class="status-val" id="sd-val">--</div></div>
      <div class="status-row"><div class="dot ok" id="heap-dot"></div><div class="status-lbl">Free Heap</div><div class="status-val" id="heap-val">--</div></div>
      <div class="status-row"><div class="dot ok"></div><div class="status-lbl">Пробуждений</div><div class="status-val" id="wkc-val">--</div></div>
      <div class="status-row"><div class="dot ok"></div><div class="status-lbl">Cal. Factor</div><div class="status-val" id="cf-val">--</div></div>
      <div class="status-row"><div class="dot ok"></div><div class="status-lbl">Offset</div><div class="status-val" id="ofs-val">--</div></div>
      <div class="status-row"><div class="dot ok"></div><div class="status-lbl">Дата/время</div><div class="status-val" id="dt-val">--</div></div>
      <div class="status-row"><div class="dot ok"></div><div class="status-lbl">Uptime</div><div class="status-val" id="upt-val">--</div></div>
    </div>

    <div class="card full">
      <div class="card-title">🐝 Информация об улье (сегодня)</div>
      <div class="grid-auto">
        <div class="info-tile"><div class="lbl">Сезон</div><div class="val" style="color:var(--amber)" id="hi-season">--</div></div>
        <div class="info-tile"><div class="lbl">Вес мин / макс</div><div class="val" style="color:var(--green);font-size:12px" id="hi-wrange">--/-- кг</div></div>
        <div class="info-tile"><div class="lbl">Темп мин / макс</div><div class="val" style="color:var(--blue);font-size:12px" id="hi-trange">--/-- °C</div></div>
        <div class="info-tile"><div class="lbl">Изменение за день</div><div class="val" id="hi-delta">-- кг</div></div>
        <div class="info-tile"><div class="lbl">Точек сегодня</div><div class="val" style="color:var(--text2)" id="hi-count">--</div></div>
        <div class="info-tile"><div class="lbl">Дней наблюдений</div><div class="val" style="color:var(--text2)" id="hi-days">--</div></div>
      </div>
    </div>

    <div class="card full">
      <div class="card-title">
        📈 Мини-график
        <span onclick="nav('chart')">[открыть полный →]</span>
      </div>
      <div class="chart-container" style="aspect-ratio:3/2">
        <div class="tip" id="tip-mini"></div>
        <div class="chart-cursor" id="cur-mini"></div>
        <div class="chart-dot" id="dot-mini"></div>
        <svg id="mini-svg" class="chart-svg" viewBox="0 0 900 600" preserveAspectRatio="xMidYMid meet"
             onmousemove="onTip(event,'mini')" onmouseleave="hideTip('mini')"
             ontouchstart="onTip(event,'mini')" ontouchmove="onTip(event,'mini')" ontouchend="onTipEnd('mini')">
          <text x="450" y="280" text-anchor="middle" fill="#506040" font-size="22">Загрузка...</text>
        </svg>
      </div>
    </div>


