darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
      <!-- Пароль AP точки доступа -->
      <div style="margin-bottom:14px">
        <div style="font-size:13px;color:var(--text2);margin-bottom:8px;font-weight:600">Пароль сети AP (BeehiveScale)</div>
        <div class="form-row" style="margin-bottom:6px">
          <label>Новый пароль (8–23 символа)</label>
          <input type="password" id="ap-pass-new" placeholder="••••••••" maxlength="23" autocomplete="new-password" oninput="checkPassStrength('ap-pass-new','ap-pass-str')">
          <div class="pass-strength" id="ap-pass-str"></div>
        </div>
        <div class="form-row" style="margin-bottom:6px">
          <label>Повтор пароля</label>
          <input type="password" id="ap-pass-confirm" placeholder="••••••••" maxlength="23" autocomplete="new-password">
        </div>
        <button class="btn btn-amber" onclick="saveApPass()">🔑 Сменить пароль AP</button>
        <div style="font-size:13px;color:var(--text3);margin-top:6px">
          Применится после перезагрузки. После смены подключайтесь к AP с новым паролем.
        </div>
      </div>

      <!-- Пароль веб-интерфейса -->
      <div class="pass-section">
        <div style="font-size:13px;color:var(--text2);margin-bottom:8px;font-weight:600">Веб-авторизация (admin)</div>
        <div class="form-row" style="margin-bottom:6px">
          <label>Логин (оставьте пустым чтобы не менять)</label>
          <input type="text" id="web-user-new" placeholder="admin" maxlength="23" autocomplete="off">
        </div>
        <div class="form-row" style="margin-bottom:6px">
          <label>Новый пароль (6-31)</label>
          <input type="password" id="web-pass-new" placeholder="********" maxlength="31" autocomplete="new-password">
        </div>
        <div class="form-row" style="margin-bottom:6px">
          <label>Повтор пароля</label>
          <input type="password" id="web-pass-confirm" placeholder="********" maxlength="31" autocomplete="new-password">
        </div>
        <button class="btn btn-amber" onclick="saveWebAuth()">🔑 Сменить пароль web</button>
        <div style="font-size:13px;color:var(--text3);margin-top:6px">
          После смены браузер запросит новый логин/пароль при первом запросе.
        </div>
      </div>

      <!-- OTA пароль -->
      <div class="pass-section">
        <div style="font-size:13px;color:var(--text2);margin-bottom:8px;font-weight:600">Пароль OTA (прошивка по воздуху)</div>
        <div class="form-row" style="margin-bottom:6px">
          <label>Новый пароль OTA (6-31)</label>
          <input type="password" id="ota-pass-new" placeholder="********" maxlength="31" autocomplete="new-password">
        </div>
        <button class="btn btn-amber" onclick="saveOtaPass()">🔑 Сменить OTA пароль</button>
        <div style="font-size:13px;color:var(--text3);margin-top:6px">
          Вступит в силу после перезагрузки.
        </div>
      </div>
    </div>

  </div>
</div>

<!-- ═══════════════ SETTINGS ═══════════════ -->
<div class="section" id="sec-settings">
  <div class="grid">
    <div class="card">
      <div class="card-title">⚙ Параметры устройства</div>
      <div class="form-row"><label>Порог тревоги Telegram (кг, 0.1–10)</label><input type="number" id="cfg-alert" step="0.1" min="0.1" max="10" placeholder="0.5"></div>
      <div class="form-row"><label>Эталонный груз калибровки (г, 100–50000)</label><input type="number" id="cfg-calib" step="100" min="100" max="50000" placeholder="1000"></div>
      <div class="form-row"><label>Скорость отклика весов (0.1=медленно, 0.3=средне, 0.6=быстро)</label><input type="number" id="cfg-ema" step="0.05" min="0.05" max="0.9" placeholder="0.3"><div style="font-size:12px;color:var(--text3);margin-top:4px">EMA α-фильтр. <b>0.1</b> ≈ 30 сек до стабилизации (для улья, фильтрует пчёл). <b>0.3</b> ≈ 10 сек (рекомендуется). <b>0.6</b> ≈ 4 сек (для тестов/калибровки).</div></div>
      <div class="form-row"><label>Deep Sleep интервал (сек, 30–86400)</label><input type="number" id="cfg-sleep" step="1" min="30" max="86400" placeholder="900"></div>
      <div class="form-row"><label>Расписание замеров (HH:MM через пробел, до 8 времён)</label><input type="text" id="cfg-sched" placeholder="08:00 14:00 20:00" maxlength="60"></div>
      <div class="form-row"><label>Уйти в сон после бездействия (сек, 0=не засыпать)</label><input type="number" id="cfg-autosleep" step="1" min="0" max="86400" placeholder="180"></div>
      <div class="form-row"><label>Таймаут подсветки LCD (сек, 0=всегда)</label><input type="number" id="cfg-bl" step="10" min="0" max="3600" placeholder="30"></div>
      <div class="btn-row">
        <button class="btn btn-green" onclick="saveSettings()">💾 Сохранить</button>
        <button class="btn btn-blue"  onclick="loadConfig()">↺ Загрузить</button>
        <button class="btn btn-red"   onclick="if(confirm('Перезагрузить ESP?'))doApi('/api/reboot')">↺ Перезагрузить</button>
      </div>
    </div>
    <div class="card">
      <div class="card-title">ℹ Описание</div>
      <div style="font-size:13px;color:var(--text3);line-height:2">
        <b style="color:var(--amber)">Порог тревоги</b> — изменение веса для уведомления в Telegram (роение, кража).<br>
        <b style="color:var(--amber)">Эталонный груз</b> — масса гири при калибровке HX711.<br>
        <b style="color:var(--amber)">Скорость отклика</b> — коэффициент EMA-фильтра шума. <b>В улье ставь 0.1–0.2</b> (фильтрует прилёт/вылет пчёл). <b>Для тестов 0.5–0.6</b> (быстрый отклик).<br>
        <b style="color:var(--amber)">Deep Sleep</b> — длительность сна ESP. Используется только если расписание не задано.<br>
        <b style="color:var(--amber)">Расписание</b> — конкретные времена пробуждения (напр. 08:00 14:00 20:00). Если задано — приоритет над интервалом.<br>
        <b style="color:var(--amber)">Auto-sleep</b> — через сколько секунд бездействия уйти в сон. 0 = не засыпать (отладка). Сбрасывается любой кнопкой и веб-запросом.<br>
        <b style="color:var(--amber)">Подсветка LCD</b> — 0 = всегда включена; иначе — таймаут без нажатий.
      </div>
    </div>
    <div class="card full">
      <div class="card-title">💾 Бэкап и восстановление</div>
      <div style="font-size:13px;color:var(--text3);margin-bottom:12px;line-height:1.7">
        Скачайте полный бэкап всех настроек (калибровка, WiFi, Telegram, настройки).<br>
        При каждом сохранении настроек бэкап автоматически копируется на SD-карту.
      </div>
      <div class="btn-row" style="gap:10px;flex-wrap:wrap">
        <button class="btn btn-green" onclick="downloadBackup()">📥 Скачать бэкап</button>
        <label class="btn btn-amber" style="cursor:pointer">📤 Загрузить бэкап<input type="file" id="backup-file" accept=".json" style="display:none" onchange="restoreBackup(this)"></label>
        <button class="btn btn-blue" onclick="viewBackup()">👁 Просмотр</button>
      </div>
      <pre id="backup-preview" style="display:none;font-size:12px;color:var(--text2);line-height:1.5;margin-top:10px;max-height:200px;overflow:auto;background:var(--bg);padding:8px;border:1px solid var(--border)"></pre>
    </div>
  </div>
</div>

<!-- ═══════════════ CALIBRATION ═══════════════ -->
<div class="section" id="sec-calib">
  <div class="grid">
    <div class="card">
      <div class="card-title">🧙 Мастер калибровки</div>
      <div class="wiz-steps">
        <div class="wiz-step active" id="ws0">1</div>
        <div class="wiz-step" id="ws1">2</div>
        <div class="wiz-step" id="ws2">3</div>
        <div class="wiz-step" id="ws3">4</div>
        <div class="wiz-step" id="ws4">✓</div>
      </div>
      <div class="wiz-body" id="wiz-body"></div>
      <div class="wiz-actions">
        <button class="btn btn-amber" id="wiz-btn" onclick="wizNext()">Далее →</button>
        <button class="btn btn-red" onclick="wizReset()">↺ Сначала</button>
        <span class="wiz-cur-w">Текущий вес: <b id="wiz-w" style="color:var(--amber)">--</b> кг</span>
      </div>
    </div>
    <div class="card">
      <div class="card-title">✏ Ручная калибровка</div>
      <div class="form-row">
        <label>Cal. Factor (текущий: <b id="cf-live" style="color:var(--amber)">--</b>)</label>
        <input type="number" id="calib-cf" step="1" min="100" max="100000" placeholder="напр. 2280">
      </div>
      <div class="form-row">
        <label>Offset (текущий: <b id="ofs-live" style="color:var(--amber)">--</b>)</label>
        <input type="number" id="calib-ofs" step="1" placeholder="обычно не меняется">
      </div>
      <div class="btn-row">
        <button class="btn btn-amber" onclick="applyCalib()">✓ Применить</button>
        <button class="btn btn-blue"  onclick="doApi('/api/tare')">⊘ Тара</button>
        <button class="btn btn-green" onclick="doApi('/api/save')">📍 Зафиксировать вес как точку отсчёта</button>
      </div>
      <div style="font-size:13px;color:var(--text3);margin-top:10px;line-height:1.7">
        Подберите Cal.Factor так, чтобы показание<br>совпало с реальной массой эталонного груза.
      </div>
    </div>
    <div class="card full">
      <div class="card-title">🔋 Калибровка батареи</div>
      <div style="font-size:13px;color:var(--text3);margin-bottom:10px;line-height:1.6">
        Реальные резисторы делителя имеют разброс ±1-5%, плюс ADC ESP32 нелинейный.
        Если показание на сайте отличается от <b>реального напряжения банки</b> (замерь мультиметром на BAT-пине модуля питания), откалибруй коэффициент.
      </div>
      <div class="form-row" style="display:grid;grid-template-columns:1fr 1fr;gap:10px">
        <div>
          <label>Сейчас прошивка показывает</label>
          <div style="font-size:18px;color:var(--amber);font-weight:bold"><span id="bcal-shown">--</span> В</div>
          <div style="font-size:11px;color:var(--text3)">ADC сырое: <span id="bcal-adc">--</span> В · Коэф.: <span id="bcal-ratio">--</span></div>
        </div>
        <div>
          <label>Реальное напряжение (с мультиметра)</label>
          <input type="number" id="bcal-real" step="0.01" min="1.5" max="5.5" placeholder="напр. 4.10">
        </div>
      </div>
      <div class="btn-row" style="margin-top:10px">
        <button class="btn btn-green" onclick="batCalibAuto()">⚙ Откалибровать автоматически</button>
        <button class="btn btn-blue"  onclick="batCalibLoad()">↺ Обновить</button>
        <button class="btn btn-amber" onclick="batCalibReset()">↻ Сбросить на 2.0 (заводское)</button>
      </div>
      <div style="font-size:12px;color:var(--text3);margin-top:10px;line-height:1.6">
        <b>Как работает:</b> ввёл реальное напряжение → прошивка рассчитала новый коэф. из ADC-сырого значения → сохранила в EEPROM навсегда (переживает прошивку).<br>
        <b>Когда калибровать:</b> один раз при первой сборке делителя, потом раз в сезон если есть смещение >0.1 В.
      </div>
    </div>
  </div>
</div>

<!-- ═══════════════ TELEGRAM ═══════════════ -->
<div class="section" id="sec-tg">
  <div class="grid">
    <div class="card">
      <div class="card-title">✉ Telegram Bot</div>
      <div class="form-row"><label>Bot Token (получить у @BotFather)</label><input type="password" id="tg-token" placeholder="123456789:ABC..." autocomplete="off"></div>
      <div class="form-row"><label>Chat ID (узнать через @userinfobot)</label><input type="text" id="tg-chatid" placeholder="-100123456789"></div>
      <div class="form-row"><label>Интервал отчётов (мин, 0=откл, 360=6ч, 1440=раз в день)</label><input type="number" id="tg-report-int" min="0" max="10080" step="60" placeholder="360"></div>
      <div class="btn-row">
        <button class="btn btn-green" onclick="saveTelegram()">💾 Сохранить</button>
        <button class="btn btn-blue"  onclick="doApi('/api/tg/test')">✉ Тест</button>
      </div>
    </div>
    <div class="card">
      <div class="card-title">🔔 Триггеры уведомлений</div>
      <div style="font-size:11px;color:var(--text3);line-height:2.1">
        ✓ Резкое изменение веса (порог: <b id="tg-thresh" style="color:var(--amber)">-- кг</b>)<br>
        ✓ Роение — быстрая потеря веса<br>
        ✓ Кража — резкое изменение<br>
        ✓ Регулярный отчёт по расписанию<br>
        ✓ Тестовое сообщение (кнопка Тест)
      </div>
      <div style="font-size:13px;color:var(--text3);margin-top:10px;padding-top:10px;border-top:1px solid var(--border)">
        Для работы Telegram нужен режим Wi-Fi <b style="color:var(--amber)">STA</b> (подключение к роутеру)
      </div>
    </div>
    <div class="card full">
      <div class="card-title">⚠ Пороги алертов (v5.0.20)</div>
      <div style="font-size:13px;color:var(--text3);margin-bottom:12px;line-height:1.7">
        Пороговые алерты — Telegram-уведомление при превышении границ. Анти-спам: каждый алерт шлётся <b>один раз</b>, повторно — только после возврата в норму (гистерезис 0.1В для батареи, 2°C для температуры).
      </div>
      <div class="form-row">
        <label>🔋 Низкая батарея — напряжение ниже (В, 0=выкл)</label>
        <input type="number" id="alrt-bat" step="0.05" min="0" max="5" placeholder="напр. 3.6">
        <div style="font-size:11px;color:var(--text3);margin-top:4px">Рекомендуется <b>3.4–3.6 В</b> — даст время приехать заменить банку до полного разряда (DW01 защита срабатывает при ~3.0 В).</div>
      </div>
      <div class="form-row">
        <label>❄️ Низкая температура — ниже °C (0=выкл)</label>
        <input type="number" id="alrt-tlow" step="0.5" min="-50" max="50" placeholder="напр. -10">
        <div style="font-size:11px;color:var(--text3);margin-top:4px">Для зимовки: -10 ÷ -15 °C — критическое подмерзание клуба.</div>
      </div>
      <div class="form-row">
        <label>🔥 Высокая температура — выше °C (0=выкл)</label>
        <input type="number" id="alrt-thigh" step="0.5" min="-50" max="80" placeholder="напр. 38">
        <div style="font-size:11px;color:var(--text3);margin-top:4px">Лето: 38–42 °C — перегрев улья на солнце.</div>
      </div>
      <div class="form-row">
        <label><input type="checkbox" id="alrt-rtc" style="margin-right:6px;vertical-align:middle"> ⏰ Алерт при RTC-ошибке (села CR2032 на DS3231)</label>
      </div>
      <div class="btn-row">
        <button class="btn btn-green" onclick="alertsSave()">💾 Сохранить</button>
        <button class="btn btn-blue"  onclick="alertsLoad()">↺ Загрузить</button>
      </div>
    </div>
  </div>
</div>

<!-- ═══════════════ API ═══════════════ -->
<div class="section" id="sec-api">
  <div class="card" style="margin-bottom:10px">
    <div class="card-title">🔌 REST API эндпоинты</div>
    <div class="api-grid">
      <div class="api-item"><div class="api-method get">GET /api/data</div><div class="api-desc">Все показания (вес/темп/бат/статус)</div></div>
      <div class="api-item"><div class="api-method get">GET /api/config</div><div class="api-desc">Конфигурация (alertDelta, ema, sleep…)</div></div>
      <div class="api-item"><div class="api-method get">GET /api/log</div><div class="api-desc">Скачать лог CSV (опц. ?date=YYYY-MM-DD)</div></div>
      <div class="api-item"><div class="api-method get">GET /api/log/json</div><div class="api-desc">Лог в JSON (для Grafana/Home Assistant)</div></div>
      <div class="api-item"><div class="api-method get">GET /api/daystat</div><div class="api-desc">Суточная статистика (опц. ?date=)</div></div>
      <div class="api-item"><div class="api-method post">POST /api/tare</div><div class="api-desc">Тарировка весов</div></div>
      <div class="api-item"><div class="api-method post">POST /api/save</div><div class="api-desc">Сохранить текущий вес как эталон</div></div>
      <div class="api-item"><div class="api-method post">POST /api/settings</div><div class="api-desc">Изменить настройки JSON {alertDelta…}</div></div>
      <div class="api-item"><div class="api-method post">POST /api/ntp</div><div class="api-desc">Синхронизация времени NTP</div></div>
      <div class="api-item"><div class="api-method post">POST /api/reboot</div><div class="api-desc">Перезагрузить ESP32</div></div>
      <div class="api-item"><div class="api-method del">POST /api/log/clear</div><div class="api-desc">Очистить лог на SD/Flash</div></div>
      <div class="api-item"><div class="api-method post">POST /api/tg/settings</div><div class="api-desc">Сохранить Telegram token/chatId</div></div>
      <div class="api-item"><div class="api-method post">POST /api/tg/test</div><div class="api-desc">Тестовое сообщение в Telegram</div></div>
      <div class="api-item"><div class="api-method post">POST /api/calib/set</div><div class="api-desc">Установить calibFactor / offset</div></div>
      <div class="api-item"><div class="api-method post">POST /api/wifi/settings</div><div class="api-desc">Режим Wi-Fi + SSID/пароль роутера</div></div>
      <div class="api-item"><div class="api-method get">GET /api/backup</div><div class="api-desc">Скачать полный бэкап настроек (JSON)</div></div>
      <div class="api-item"><div class="api-method post">POST /api/backup/restore</div><div class="api-desc">Восстановить настройки из JSON бэкапа</div></div>
    </div>
  </div>
  <div class="card">
    <div class="card-title">👁 Live /api/data
      <button class="btn btn-blue" style="padding:2px 10px;font-size:12px" onclick="refreshApiView()">↺ Обновить</button>
    </div>
    <pre id="api-json" style="font-size:13px;color:var(--text2);line-height:1.6;overflow-x:auto;white-space:pre-wrap">Загрузка...</pre>
  </div>
</div>

<!-- ═══════════════ ARCHIVE ═══════════════ -->
<div class="section" id="sec-archive">
  <div class="card" style="margin-bottom:10px">
    <div class="card-title">📅 Выбор периода</div>
    <div style="display:flex;gap:8px;flex-wrap:wrap;align-items:center;margin-bottom:10px">
      <label style="font-size:13px;color:var(--text2)">С: <input type="date" id="arch-from" style="background:var(--bg);color:var(--text);border:1px solid var(--border);padding:6px;border-radius:4px;font-family:var(--mono)"></label>
      <label style="font-size:13px;color:var(--text2)">По: <input type="date" id="arch-to" style="background:var(--bg);color:var(--text);border:1px solid var(--border);padding:6px;border-radius:4px;font-family:var(--mono)"></label>
      <button class="btn btn-amber" onclick="archLoad()" style="padding:6px 14px">🔄 Загрузить</button>
    </div>
    <div style="display:flex;gap:6px;flex-wrap:wrap">
      <button class="btn" onclick="archPreset(0)" style="background:var(--panel);border:1px solid var(--border);color:var(--text);padding:6px 12px;font-size:12px">Сегодня</button>
      <button class="btn" onclick="archPreset(2)" style="background:var(--panel);border:1px solid var(--border);color:var(--text);padding:6px 12px;font-size:12px">3 дня</button>
      <button class="btn" onclick="archPreset(6)" style="background:var(--panel);border:1px solid var(--border);color:var(--text);padding:6px 12px;font-size:12px">Неделя</button>
      <button class="btn" onclick="archPreset(29)" style="background:var(--panel);border:1px solid var(--border);color:var(--text);padding:6px 12px;font-size:12px">Месяц</button>
      <button class="btn" id="arch-since-btn" onclick="archSinceLastVisit()" style="background:var(--amber);border:1px solid var(--amber);color:#1a1a2e;padding:6px 12px;font-size:12px;display:none">↩ С прошлого визита</button>
      <button class="btn" onclick="archPreset(-1)" style="background:var(--panel);border:1px solid var(--border);color:var(--text);padding:6px 12px;font-size:12px">Всё</button>
    </div>
    <div id="arch-last-visit-info" style="font-size:12px;color:var(--text3);margin-top:8px;display:none"></div>
  </div>

