darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
  <div class="card" id="arch-summary" style="margin-bottom:10px;display:none">
    <div style="display:flex;justify-content:space-between;flex-wrap:wrap;gap:10px">
      <div><span style="color:var(--text2);font-size:13px">Период:</span> <b id="arch-range">—</b></div>
      <div><span style="color:var(--text2);font-size:13px">Записей:</span> <b id="arch-count">—</b></div>
      <div><span style="color:var(--text2);font-size:13px">Σ за период:</span> <b id="arch-delta" style="color:var(--green)">—</b></div>
    </div>
  </div>

  <div class="card" style="margin-bottom:10px">
    <div class="card-title">📊 По дням</div>
    <div id="arch-list" style="font-size:14px;color:var(--text2)">Выберите период и нажмите «Загрузить»</div>
  </div>

  <div class="card">
    <div class="card-title">⬇ Скачать</div>
    <button class="btn btn-blue" style="width:100%;margin-bottom:6px" onclick="archDownloadRange()">📥 CSV за выбранный период</button>
    <button class="btn btn-green" style="width:100%" onclick="window.open('/api/log','_blank')">📥 Весь лог CSV</button>
    <div style="font-size:12px;color:var(--text3);margin-top:8px">Файлы откроются в Excel / LibreOffice. Разделитель «;», десятичная запятая.</div>
  </div>
</div>

<div class="toast" id="toast"></div>

<script>
// ── Globals ─────────────────────────────────────────────────────────
const REFRESH = 5000;
let _start = Date.now();
let _all = [];           // весь лог
let _curWeight = 0;      // текущий вес для мини-графика
let _periodH = 1;
let _serVisible = {w:true, t:true, b:true};
let _wizStep = 0;
let _wifiMode = 0;
let _csrfTok = '';       // обновляется через /api/data
// Данные для тултипов (по серии)
let _tipPts = {};
function esc(s){var d=document.createElement('div');d.textContent=String(s);return d.innerHTML;}
// Обёртка fetch с автоматическим X-CSRF-Token для POST
function apiFetch(url, opts){
  opts = opts || {};
  opts.headers = opts.headers || {};
  if ((opts.method||'GET').toUpperCase() !== 'GET' && _csrfTok){
    opts.headers['X-CSRF-Token'] = _csrfTok;
  }
  return fetch(url, opts);
}

// ── Nav ──────────────────────────────────────────────────────────────
function nav(id) {
  document.querySelectorAll('.section').forEach(s=>s.classList.remove('active'));
  document.querySelectorAll('.tab').forEach(t=>t.classList.remove('active'));
  document.getElementById('sec-'+id).classList.add('active');
  const idx = {main:0,archive:1,chart:2,wifi:3,settings:4,calib:5,tg:6,api:7};
  document.querySelectorAll('.tab')[idx[id]].classList.add('active');
  if (id==='chart') renderCharts();
  if (id==='api')   refreshApiView();
  if (id==='settings'||id==='tg') loadConfig(true);
  if (id==='wifi') loadConfig(true);
  if (id==='calib') { fetchData(); }   // немедленно обновить cf-live, ofs-live, wiz-w
  if (id==='archive') archInit();
}

// ── Refresh bar ───────────────────────────────────────────────────────
const bar = document.getElementById('rbar');
function tickBar() {
  const pct = Math.max(0, 100-(Date.now()-_start)/REFRESH*100);
  bar.style.width = pct+'%';
  if (Date.now()-_start < REFRESH) requestAnimationFrame(tickBar);
}
tickBar();

// ── Clock ─────────────────────────────────────────────────────────────
(function tick() {
  const t=new Date(), p=n=>String(n).padStart(2,'0');
  document.getElementById('cur-time').textContent = p(t.getHours())+':'+p(t.getMinutes())+':'+p(t.getSeconds());
  setTimeout(tick, 1000);
})();

// ── Toast ─────────────────────────────────────────────────────────────
function toast(msg, err) {
  const el = document.getElementById('toast');
  el.textContent=msg; el.className='toast'+(err?' err':'')+' show';
  setTimeout(()=>el.classList.remove('show'), 3500);
}

// ── API ───────────────────────────────────────────────────────────────
function doApi(url) {
  const method = (url.includes('/data')||(url.includes('/log')&&!url.includes('/clear'))||url.includes('/config')||url.includes('/daystat')||url.endsWith('/backup')) ? 'GET' : 'POST';
  return apiFetch(url,{method}).then(r=>r.json()).then(d=>{
    toast(d.msg||(d.ok?'OK':'Ошибка'), !d.ok); return d;
  }).catch(()=>toast('Нет связи',true));
}

// ── Keepalive: продлить работу на 10 минут ────────────────────────────
function doKeepAlive() {
  apiFetch('/api/keepalive',{method:'POST'}).then(r=>r.json()).then(d=>{
    toast(d.msg||(d.ok?'Продлено':'Ошибка'), !d.ok);
    if (d.ok) fetch('/api/data').then(r=>r.json()).then(updDash).catch(()=>{});
  }).catch(()=>toast('Нет связи',true));
}
function _fmtMmSs(sec) {
  if (sec <= 0) return '0:00';
  const m = Math.floor(sec/60), s = sec%60;
  return m + ':' + (s<10?'0':'') + s;
}

// ── Fetch /api/data ───────────────────────────────────────────────────
// ESP32 WebServer синхронный — обрабатывает 1 запрос за раз. Параллельные fetch()
// от браузера сериализуются в случайном порядке, и медленный /api/log/json (стрим
// всего лога) может оказаться первым → дашборд не показывается пока лог не передан.
// Решение: chain'им запросы — /api/data → /api/daystat → /api/log/json.
// Дашборд рендерится сразу, лог тянется в фоне. Лог обновляем не чаще раз в 30 сек.
let _lastLogFetch = 0;
function fetchData() {
  fetch('/api/data').then(r=>r.json()).then(updDash).catch(()=>{})
    .then(()=>fetch('/api/daystat').then(r=>r.json()).then(updHive).catch(()=>{}))
    .then(()=>{
      const now = Date.now();
      // Throttle: первый раз грузим всегда, дальше — раз в 30 сек
      if (_lastLogFetch && (now - _lastLogFetch) < 30000) return;
      _lastLogFetch = now;
      loadLog();
    });
}

function updDash(d) {
  if (d && d.csrf) _csrfTok = d.csrf;
  if (d && d.credsDefault) showCredsWarning();
  if (d && d.fw) { const fv=document.getElementById('fw-ver'); if (fv && !fv.textContent) fv.textContent='v'+d.fw; }
  // Статус продления auto-sleep
  const kaEl = document.getElementById('ka-status');
  if (kaEl) {
    const left = parseInt(d && d.keepLeftSec || 0);
    if (left > 0) {
      kaEl.textContent = 'продлено, осталось ' + _fmtMmSs(left);
      kaEl.style.color = 'var(--green)';
    } else {
      kaEl.textContent = 'обычный режим';
      kaEl.style.color = 'var(--amber)';
    }
  }
  const w = parseFloat(d.weight)||0;
  _curWeight = w;
  setText('w-val', w.toFixed(2)+'<span class="val-unit">кг</span>', true);
  setText('w-ref', parseFloat(d.prev||0).toFixed(2));
  const dw = w-parseFloat(d.prev||0);
  const dwEl=document.getElementById('w-delta');
  dwEl.textContent=(dw>=0?'+':'')+dw.toFixed(2);
  dwEl.style.color=dw>0?'var(--green)':dw<0?'var(--red)':'var(--amber2)';
  // Дата фиксации (Unix timestamp → ДД.ММ.ГГГГ ЧЧ:ММ)
  const refDate = parseInt(d.prevDate||0);
  const rdEl = document.getElementById('w-ref-date');
  if (rdEl) {
    if (refDate > 0) {
      const dt = new Date(refDate * 1000);
      const dd = String(dt.getDate()).padStart(2,'0');
      const mm = String(dt.getMonth()+1).padStart(2,'0');
      const yyyy = dt.getFullYear();
      const hh = String(dt.getHours()).padStart(2,'0');
      const mi = String(dt.getMinutes()).padStart(2,'0');
      // Дни с момента фиксации (для контекста "уже X дней наблюдаю")
      const daysAgo = Math.floor((Date.now()/1000 - refDate) / 86400);
      rdEl.textContent = 'от ' + dd + '.' + mm + '.' + yyyy + ' ' + hh + ':' + mi
                        + (daysAgo > 0 ? ', ' + daysAgo + ' дн назад' : '');
    } else {
      rdEl.textContent = 'не зафикс.';
    }
  }
  // Дельта "за период" — сравнение с весом на момент прошлого TG-отчёта
  const lastRep = parseFloat(d.lastRep||0);
  const hasRep  = d.hasRep === true || d.hasRep === 'true';
  const wpdEl = document.getElementById('w-period-delta');
  const wppEl = document.getElementById('w-period-prev');
  if (wpdEl && wppEl) {
    if (hasRep) {
      const dp = w - lastRep;
      wpdEl.textContent = (dp>=0?'+':'')+dp.toFixed(2);
      wpdEl.style.color = dp>0?'var(--green)':dp<0?'var(--red)':'var(--amber2)';
      wppEl.textContent = lastRep.toFixed(2);
    } else {
      wpdEl.textContent = '—';
      wppEl.textContent = 'нет данных';
    }
  }
  setGauge('w-gauge','w-gpct', Math.min(100,w/80*100), '', '%');

  const t=parseFloat(d.temp), rtcT=parseFloat(d.rtcT||0);
  if (!isNaN(t)&&t>-90) {
    setText('t-val',t.toFixed(1)+'<span class="val-unit">°C</span>',true);
    setGauge('t-gauge','t-gpct', Math.min(100,Math.max(0,(t+20)/70*100)), t.toFixed(1), '°C');
  } else {
    setText('t-val','---<span class="val-unit">°C</span>',true);
    setGauge('t-gauge','t-gpct', 0, '---', '°C');
  }
  setText('rtc-val', rtcT.toFixed(1));

  const bv=parseFloat(d.batV||0), bp=parseFloat(d.batPct||0);
  setText('bat-v-big',bv.toFixed(2)+'<span class="val-unit">В</span>',true);
  setText('bat-pct-v',bp.toFixed(0)+'%');
  const bColor=bp<20?'var(--red)':bp<40?'var(--amber)':'var(--green)';
  document.getElementById('bat-gauge').style.background=bColor;
  setGauge('bat-gauge','bat-gpct',bp,'','%');

  // Status
  setDot('sr-dot',d.sensor,'ok','err'); setText('sr-val',d.sensor?'OK':'Ошибка');
  setDot('wf-dot',d.wifi,'ok','warn'); setText('wf-val',d.wifi?'Подключён':'AP режим');
  setText('wkc-val',d.wakeups||0);
  setText('cf-val',parseFloat(d.cf||0).toFixed(0));
  setText('ofs-val',d.offset||0);
  setText('dt-val',d.datetime||'--');
  setText('upt-val',d.uptime||'--');
  const heap=parseInt(d.heap||0);
  setText('heap-val',(heap/1024).toFixed(1)+' KB');
  setDot('heap-dot',heap>5000,'ok','warn');
  const sdKb=Math.round(parseInt(d.sdLog||0)/1024);
  const freeKb=Math.round(parseInt(d.sdFree||0)/1024);
  // Свободное место известно только при LittleFS (fallback); SD-библиотека его не отдаёт
  const freeKnown=!!d.sdFallback;
  const totalKb=freeKnown?sdKb+freeKb:0;
  const memPct=totalKb>0?Math.min(100,sdKb/totalKb*100):0;
  // Gauge памяти/лога
  const mColor=memPct>90?'var(--red)':memPct>70?'var(--amber)':'var(--green)';
  const memGauge=document.getElementById('mem-gauge');
  if(memGauge){memGauge.style.background=mColor;setGauge('mem-gauge','mem-gpct',memPct,memPct.toFixed(0),'%');}
  setText('mem-used',sdKb);setText('mem-total',freeKnown?totalKb:'?');
  // Предупреждение: ФС не смонтирована
  const fsOk=!!d.sdOk;
  const sdDot=document.getElementById('sd-dot');
  if(sdDot) sdDot.className='dot '+(fsOk?'ok':'err');
  if(fsOk) setText('sd-val',sdKb+' KB / своб. '+(freeKnown?freeKb+' KB':'н/д'));
  else setText('sd-val','⚠ ФС не доступна');

