darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
  // Calib live
  if (document.getElementById('cf-live')) setText('cf-live',parseFloat(d.cf||0).toFixed(0));
  if (document.getElementById('ofs-live')) setText('ofs-live',d.offset||0);
  if (document.getElementById('wiz-w')) setText('wiz-w',parseFloat(d.weight||0).toFixed(2));
  // Автозаполнение поля CF текущим значением, если пользователь ещё не вводил своё
  var cfInput=document.getElementById('calib-cf');
  if(cfInput&&cfInput.value===''&&d.cf) cfInput.value=Math.round(parseFloat(d.cf||0));
}

function updHive(d) {
  if (!d) return;
  const s={Vesna:'🌸 Весна',Leto:'☀ Лето',Osen:'🍂 Осень',Zima:'❄ Зима'};
  setText('hi-season',s[d.season]||d.season||'--');
  if (d.valid) {
    setText('hi-wrange',d.wMin.toFixed(2)+' / '+d.wMax.toFixed(2)+' кг');
    if (!isNaN(d.tMin)) setText('hi-trange',d.tMin.toFixed(1)+' / '+d.tMax.toFixed(1)+' °C');
    const dk=parseFloat(d.deltaKg||0);
    const de=document.getElementById('hi-delta');
    de.textContent=(dk>=0?'+':'')+dk.toFixed(2)+' кг';
    de.style.color=dk>0?'var(--green)':dk<0?'var(--red)':'var(--text2)';
    setText('hi-count',d.count||0);
    setText('hi-days',d.daysSinceStart||0);
  }
}

function setText(id,v,html) {
  const el=document.getElementById(id);
  if(!el)return;
  if(html) el.innerHTML=v; else el.textContent=v;
}
function setGauge(gid,lid,pct,val,unit) {
  const g=document.getElementById(gid),l=document.getElementById(lid);
  if(g) g.style.width=pct.toFixed(0)+'%';
  if(l) l.textContent=val+unit;
}
function setDot(id,ok,cOk,cBad) {
  const el=document.getElementById(id);
  if(el) el.className='dot '+(ok?cOk:cBad);
}

// ── Load log ──────────────────────────────────────────────────────────
function loadLog() {
  fetch('/api/log/json').then(r=>r.json()).then(data=>{
    _all = data;
    drawMini();
    if (document.getElementById('sec-chart').classList.contains('active')) renderCharts();
  }).catch(()=>{
    drawMini();
    if(document.getElementById('sec-chart').classList.contains('active')) renderCharts();
  });
}

// ── Mini chart ────────────────────────────────────────────────────────
function drawMini() {
  const svg=document.getElementById('mini-svg');
  if (!_all||_all.length<2) {
    const wt=_curWeight>0?_curWeight.toFixed(2)+' кг':'--';
    svg.innerHTML='<text x="450" y="270" text-anchor="middle" fill="#f5a623" font-size="42" font-weight="bold">'+wt+'</text>'+
      '<text x="450" y="320" text-anchor="middle" fill="#506040" font-size="26">Лог пуст — нет данных для графика</text>';
    return;
  }
  const pts=_all.slice(-120);
  _tipPts.mini=pts;
  drawLineSvg(svg,pts,'w','#f5a623',900,600,90,15,12,90,true);
}

// ── Chart page ────────────────────────────────────────────────────────
function setPeriod(h,btn) {
  _periodH=h;
  document.querySelectorAll('.period-btn').forEach(b=>b.classList.remove('active'));
  btn.classList.add('active');
  renderCharts();
}

function toggleSeries(s,btn) {
  _serVisible[s]=!_serVisible[s];
  btn.classList.toggle('active',_serVisible[s]);
  const wrap=document.getElementById('cwrap-'+s);
  if(wrap) wrap.style.display=_serVisible[s]?'':'none';
  renderCharts();
}

function filterPts() {
  if (!_periodH) return _all;
  const cutoff=Date.now()-_periodH*3600000;
  const f=_all.filter(d=>{
    const m=d.dt&&d.dt.match(/(\d{2})\.(\d{2})\.(\d{4})\s+(\d{2}):(\d{2}):(\d{2})/);
    if(m) return new Date(+m[3],+m[2]-1,+m[1],+m[4],+m[5],+m[6]).getTime()>=cutoff;
    return true;
  });
  // Возвращаем fallback если точек меньше 2 (drawLineSvg требует ≥2 точки)
  if (f.length < 2) {
    const n=_periodH===1?60:_periodH===6?360:_periodH*60;
    return _all.slice(-Math.min(n,_all.length));
  }
  return f;
}

function renderCharts() {
  if (!_all.length) {
    [{id:'chart-w',cy:240},{id:'chart-t',cy:240},{id:'chart-b',cy:240}].forEach(function(s){
      var svg=document.getElementById(s.id);
      if(svg) svg.innerHTML='<text x="450" y="'+s.cy+'" text-anchor="middle" fill="#506040" font-size="22">Нет данных</text>';
    });
    return;
  }
  const pts=filterPts();
  if (!pts.length) return;
  _tipPts={};

  if (_serVisible.w) {
    _tipPts.w=pts;
    const ws=pts.map(d=>parseFloat(d.w)).filter(v=>!isNaN(v));
    const mn=ws.reduce((a,b)=>a<b?a:b),mx=ws.reduce((a,b)=>a>b?a:b),av=ws.reduce((a,b)=>a+b,0)/ws.length;
    setText('c-wmin',mn.toFixed(2)); setText('c-wmax',mx.toFixed(2));
    setText('c-wavg',av.toFixed(2)); setText('c-pts',pts.length);
    drawLineSvg(document.getElementById('chart-w'),pts,'w','#f5a623',900,500,90,15,12,85,true);
  }
  if (_serVisible.t) {
    _tipPts.t=pts;
    const ts=pts.map(d=>parseFloat(d.t)).filter(v=>!isNaN(v)&&v>-90);
    if(ts.length){setText('c-tmin',ts.reduce((a,b)=>a<b?a:b).toFixed(1));setText('c-tmax',ts.reduce((a,b)=>a>b?a:b).toFixed(1));}
    drawLineSvg(document.getElementById('chart-t'),pts,'t','#56ccf2',900,500,90,15,12,85,true);
  }
  if (_serVisible.b) {
    _tipPts.b=pts;
    drawLineSvg(document.getElementById('chart-b'),pts,'b','#6fcf97',900,500,90,15,12,85,true);
  }
}

// ── Universal SVG line drawing ────────────────────────────────────────
function drawLineSvg(svg,pts,key,color,W,H,L,R,T,B,showAxes) {
  const pW=W-L-R, pH=H-T-B;
  const vals=pts.map(d=>parseFloat(d[key])).filter(v=>!isNaN(v)&&v>-90);
  if (vals.length<2) { svg.innerHTML=`<text x="${W/2}" y="${H/2}" text-anchor="middle" fill="#506040" font-size="22">Нет данных</text>`; return; }
  // Для температуры и батареи: игнорируем нули при расчёте шкалы (0 = датчик не работал / USB)
  let scaleVals=(key==='t'||key==='b')?vals.filter(v=>v>0.05):vals;
  if(scaleVals.length<2) scaleVals=vals;
  let mn=scaleVals.reduce((a,b)=>a<b?a:b),mx=scaleVals.reduce((a,b)=>a>b?a:b);
  // Добавляем 5% padding сверху/снизу чтобы линия не прилипала к краям
  const range=mx-mn||1;
  mn-=range*0.05; mx+=range*0.05;
  if(mx===mn){mn-=0.5;mx+=0.5;}
  const xS=i=>L+i/(pts.length-1||1)*pW;
  const yS=v=>T+pH-(v-mn)/(mx-mn)*pH;
  let html='';
  // grid — 6 горизонтальных линий для лучшей читаемости
  const yLines=6;
  for(let k=0;k<=yLines;k++){
    const v=mn+(mx-mn)*k/yLines,y=yS(v);
    html+=`<line x1="${L}" y1="${y.toFixed(1)}" x2="${W-R}" y2="${y.toFixed(1)}" stroke="#1a201a" stroke-width="1"/>`;
    if(showAxes) {
      const dec=key==='b'?2:key==='t'?1:3;
      html+=`<text x="${L-5}" y="${(y+9).toFixed(1)}" text-anchor="end" fill="#506040" font-size="26">${v.toFixed(dec)}</text>`;
    }
  }
  // x labels — 5-7 меток равномерно
  if(showAxes && pts.length>1){
    const xCount=Math.min(7,pts.length);
    for(let n=0;n<xCount;n++){
      const i=Math.round(n*(pts.length-1)/(xCount-1));
      const x=xS(i),lbl=pts[i].dt?esc(pts[i].dt.substring(11,16)):'';
      const a=n===0?'start':n===xCount-1?'end':'middle';
      html+=`<line x1="${x.toFixed(1)}" y1="${T}" x2="${x.toFixed(1)}" y2="${T+pH}" stroke="#181d18" stroke-dasharray="3,3" stroke-width="1"/>`;
      html+=`<text x="${x.toFixed(1)}" y="${H-B+28}" text-anchor="${a}" fill="#506040" font-size="24">${lbl}</text>`;
    }
    // date labels at edges — под осью X, не наложение на время
    const d0=pts[0].dt?esc(pts[0].dt.substring(0,10)):'';
    const d1=pts[pts.length-1].dt?esc(pts[pts.length-1].dt.substring(0,10)):'';
    if(d0) html+=`<text x="${L}" y="${H-B+52}" text-anchor="start" fill="#3d5030" font-size="18">${d0}</text>`;
    if(d1&&d1!==d0) html+=`<text x="${W-R}" y="${H-B+52}" text-anchor="end" fill="#3d5030" font-size="18">${d1}</text>`;
  }
  // axes
  if(showAxes){
    html+=`<line x1="${L}" y1="${T}" x2="${L}" y2="${T+pH}" stroke="#506040" stroke-width="1.5"/>`;
    html+=`<line x1="${L}" y1="${T+pH}" x2="${W-R}" y2="${T+pH}" stroke="#506040" stroke-width="1.5"/>`;
  }
  // area + line
  let area='',line='',li=-1;
  for(let i=0;i<pts.length;i++){
    const v=parseFloat(pts[i][key]);
    if(isNaN(v)||v<=-90) continue;
    if((key==='t'||key==='b')&&Math.abs(v)<0.05&&scaleVals!==vals) continue;
    const xx=xS(i).toFixed(1),yy=yS(v).toFixed(1);
    if(li<0){area=`M ${xx} ${T+pH}`;line=`M ${xx} ${yy}`;}
    else{area+=` L ${xx} ${yy}`;line+=` L ${xx} ${yy}`;}
    li=i;
  }
  if(li>=0){
    area+=` L ${xS(li).toFixed(1)} ${T+pH} Z`;
    html+=`<path d="${area}" fill="${color}18" stroke="none"/>`;
    html+=`<path d="${line}" fill="none" stroke="${color}" stroke-width="2"/>`;
    const lv=parseFloat(pts[li][key]);
    html+=`<circle cx="${xS(li).toFixed(1)}" cy="${yS(lv).toFixed(1)}" r="4" fill="${color}"/>`;
  }
  svg.innerHTML=html;
}

// ── Tooltip + интерактивный курсор (mouse + touch) ────────────────────
let _tipHideTimer = {};
function onTip(e,s){
  const pts=_tipPts[s];
  if(!pts||!pts.length) return;
  // Поддержка touch — берём первый палец
  let cX, cY;
  if (e.touches && e.touches.length) {
    cX = e.touches[0].clientX; cY = e.touches[0].clientY;
    if (e.cancelable) e.preventDefault();  // блокируем скролл страницы при скрабе по графику
  } else {
    cX = e.clientX; cY = e.clientY;
  }
  const key={w:'w',t:'t',b:'b',mini:'w'}[s];
  const color={w:'var(--amber)',t:'var(--blue)',b:'var(--green)',mini:'var(--amber)'}[s];
  const unit={w:' кг',t:' °C',b:' В',mini:' кг'}[s];
  // viewBox геометрия: mini=900x600, charts=900x500. L,R одинаковые.
  const W=900,L=90,R=15;
  const H=(s==='mini')?600:500;
  const T=12, B=(s==='mini')?90:85;
  const pW=W-L-R, pH=H-T-B;
  const svg=e.currentTarget, rect=svg.getBoundingClientRect();
  const relX=cX-rect.left, relY=cY-rect.top;
  // Преобразуем экранные координаты в viewBox-координаты
  // SVG с preserveAspectRatio="xMidYMid meet" может иметь вертикальные отступы — учтём
  const scale = Math.min(rect.width/W, rect.height/H);
  const svgW = W*scale, svgH = H*scale;
  const padX = (rect.width-svgW)/2, padY=(rect.height-svgH)/2;
  const svgX = (relX-padX)/scale;
  // Найти ближайшую точку
  let best=-1,bestD=9999;
  for(let i=0;i<pts.length;i++){const x=L+i/(pts.length-1||1)*pW,d=Math.abs(x-svgX);if(d<bestD){bestD=d;best=i;}}
  if(best<0||bestD>pW/pts.length*3){hideTip(s);return;}
  const p=pts[best], v=parseFloat(p[key]);
  // Найти Y для точки (в viewBox)
  const vals=pts.map(d=>parseFloat(d[key])).filter(x=>!isNaN(x)&&x>-90);
  let scaleVals=(key==='t'||key==='b')?vals.filter(x=>x>0.05):vals;
  if(scaleVals.length<2) scaleVals=vals;
  let mn=scaleVals.reduce((a,b)=>a<b?a:b), mx=scaleVals.reduce((a,b)=>a>b?a:b);
  const range=mx-mn||1; mn-=range*0.05; mx+=range*0.05;
  if(mx===mn){mn-=0.5;mx+=0.5;}
  const xVB = L+best/(pts.length-1||1)*pW;
  const yVB = !isNaN(v)&&v>-90 ? T+pH-(v-mn)/(mx-mn)*pH : T+pH/2;
  // Пересчёт обратно в экран
  const screenX = padX + xVB*scale;
  const screenY = padY + yVB*scale;
  // Курсор-линия и точка — позиция считается от родителя .chart-container, а не от SVG
  const containerEl = svg.closest('.chart-container');
  const cRect = containerEl ? containerEl.getBoundingClientRect() : rect;
  const ox = rect.left - cRect.left;  // смещение SVG внутри контейнера
  const oy = rect.top - cRect.top;
  const cur=document.getElementById('cur-'+s);
  const dot=document.getElementById('dot-'+s);
  if(cur){cur.style.left=(ox+screenX)+'px';cur.style.top=oy+'px';cur.style.height=rect.height+'px';cur.style.background=color;cur.style.display='block';}
  if(dot){dot.style.left=(ox+screenX)+'px';dot.style.top=(oy+screenY)+'px';dot.style.background=color;dot.style.borderColor='#fff';dot.style.boxShadow='0 0 6px '+color;dot.style.display='block';}
  // Tooltip
  const tip=document.getElementById('tip-'+s);
  tip.innerHTML=`<b style="color:${color}">${isNaN(v)||v<=-90?'--':v.toFixed(key==='b'?3:2)+unit}</b><br>${esc(p.dt||'')}`;
  tip.style.display='block';
  let tx=relX+12, ty=relY-58;
  if(tx+150>rect.width) tx=relX-160;
  if(ty<0) ty=relY+18;
  tip.style.left=tx+'px'; tip.style.top=ty+'px';
  // Авто-скрытие после касания
  if(_tipHideTimer[s]){clearTimeout(_tipHideTimer[s]);_tipHideTimer[s]=null;}
}
function hideTip(s){
  const el=document.getElementById('tip-'+s);if(el)el.style.display='none';
  const cur=document.getElementById('cur-'+s);if(cur)cur.style.display='none';
  const dot=document.getElementById('dot-'+s);if(dot)dot.style.display='none';
}
// Touch-end — скрываем через 2 сек, чтобы успеть прочесть значение
function onTipEnd(s){
  if(_tipHideTimer[s]) clearTimeout(_tipHideTimer[s]);
  _tipHideTimer[s] = setTimeout(()=>hideTip(s), 2000);
}

// ── Export ────────────────────────────────────────────────────────────
function getExpData() {
  let data=_all;
  const from=document.getElementById('exp-from').value;
  const to=document.getElementById('exp-to').value;
  if(from||to) data=data.filter(d=>{
    if(!d.dt) return true;
    const m=d.dt.match(/(\d{2})\.(\d{2})\.(\d{4})/);
    if(!m) return true;
    const ds=`${m[3]}-${m[2]}-${m[1]}`;
    return (!from||ds>=from)&&(!to||ds<=to);
  });
  const cols=[];
  if(document.getElementById('col-dt').checked)  cols.push({k:'dt',h:'Дата/время'});
  if(document.getElementById('col-w').checked)   cols.push({k:'w',h:'Вес, кг'});
  if(document.getElementById('col-t').checked)   cols.push({k:'t',h:'Темп, °C'});
  if(document.getElementById('col-bat').checked) cols.push({k:'b',h:'Батарея, В'});
  return {data,cols};
}

