darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
// ── Calibration wizard ────────────────────────────────────────────────
const WIZ=[
  {l:'Пусто',   b:'<b>Шаг 1: Уберите все грузы.</b><br>Платформа весов должна быть абсолютно пустой. Нажмите «Далее».'},
  {l:'Тара',    b:'<b>Шаг 2: Тарировка.</b><br>Нажмите «Тарировать» — показание обнулится.<br>Текущий вес должен стать близким к 0.'},
  {l:'Груз',    b:'<b>Шаг 3: Поставьте эталонный груз.</b><br>Используйте гирю с известной массой (задана в Настройках).<br>Дождитесь стабилизации показания.'},
  {l:'Cal.F.',  b:'<b>Шаг 4: Подберите Cal.Factor.</b><br>В правой панели «Ручная калибровка» введите CF и нажмите «Применить».<br>Добивайтесь совпадения «Вес (wiz)» с реальной массой груза. Поле CF автозаполнено текущим значением.'},
  {l:'Готово',  b:'<b>✓ Калибровка завершена!</b><br>Уберите груз → Тарировка → «Сохранить эталон» на главной.'},
];
function updateWiz(){
  WIZ.forEach((_,i)=>{
    document.getElementById('ws'+i).className='wiz-step'+(i<_wizStep?' done':i===_wizStep?' active':'');
  });
  document.getElementById('wiz-body').innerHTML=WIZ[_wizStep].b;
  const btn=document.getElementById('wiz-btn');
  btn.textContent=_wizStep===1?'⊘ Тарировать':_wizStep===WIZ.length-1?'↺ Заново':'Далее →';
}
function wizNext(){
  if(_wizStep===1){doApi('/api/tare').then(()=>setTimeout(fetchData,1500));_wizStep++;updateWiz();return;}
  if(_wizStep===WIZ.length-1){wizReset();return;}
  _wizStep++;updateWiz();
}
function wizReset(){_wizStep=0;updateWiz();}

function applyCalib(){
  const cf=parseFloat(document.getElementById('calib-cf').value);
  const ofs=document.getElementById('calib-ofs').value;
  const body={};
  if(!isNaN(cf)) body.calibFactor=cf;
  if(ofs!=='') body.offset=parseInt(ofs);
  if(Object.keys(body).length===0){toast('Введите значение Cal.Factor',true);return;}
  apiFetch('/api/calib/set',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify(body)})
    .then(r=>r.json()).then(d=>{toast(d.msg||'OK',!d.ok);if(d.ok)fetchData();}).catch(()=>toast('Нет связи',true));
}

// ── Battery calibration (v5.0.19) ─────────────────────────────────────
function batCalibLoad(){
  fetch('/api/battery/calib').then(r=>r.json()).then(d=>{
    document.getElementById('bcal-shown').textContent=(d.smoothed||d.batV||0).toFixed(2);
    document.getElementById('bcal-adc').textContent=(d.adcV||0).toFixed(3);
    document.getElementById('bcal-ratio').textContent=(d.ratio||0).toFixed(3);
  }).catch(()=>{});
}
function batCalibAuto(){
  const real=parseFloat(document.getElementById('bcal-real').value);
  if(isNaN(real)||real<1.5||real>5.5){toast('Введи реальное напряжение (1.5-5.5 В)',true);return;}
  apiFetch('/api/battery/calib',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify({realVoltage:real})})
    .then(r=>r.json()).then(d=>{
      if(d.status==='ok'){toast('Откалибровано! Коэф: '+d.ratio.toFixed(3));batCalibLoad();fetchData();}
      else toast('Ошибка калибровки',true);
    }).catch(()=>toast('Нет связи',true));
}
function batCalibReset(){
  if(!confirm('Сбросить коэффициент батареи на 2.0 (заводское)?'))return;
  apiFetch('/api/battery/calib',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify({ratio:2.0})})
    .then(r=>r.json()).then(d=>{
      if(d.status==='ok'){toast('Сброшено на 2.0');batCalibLoad();fetchData();}
    }).catch(()=>toast('Нет связи',true));
}
// Авто-загрузка при переключении на вкладку Калибровка / Telegram
(function(){
  const origNav=window.nav;
  if(typeof origNav==='function'){
    window.nav=function(id){
      origNav(id);
      if(id==='calib')batCalibLoad();
      if(id==='tg')alertsLoad();
    };
  }
})();

// ── Telegram alerts (v5.0.20) ─────────────────────────────────────────
function alertsLoad(){
  fetch('/api/alerts').then(r=>r.json()).then(d=>{
    document.getElementById('alrt-bat').value   = (d.batLowV  > 0) ? d.batLowV  : '';
    document.getElementById('alrt-tlow').value  = (d.tempLow  != 0) ? d.tempLow  : '';
    document.getElementById('alrt-thigh').value = (d.tempHigh != 0) ? d.tempHigh : '';
    document.getElementById('alrt-rtc').checked = !!d.rtcEn;
  }).catch(()=>{});
}
function alertsSave(){
  const body = {
    batLowV:  parseFloat(document.getElementById('alrt-bat').value)   || 0,
    tempLow:  parseFloat(document.getElementById('alrt-tlow').value)  || 0,
    tempHigh: parseFloat(document.getElementById('alrt-thigh').value) || 0,
    rtcEn:    document.getElementById('alrt-rtc').checked
  };
  apiFetch('/api/alerts',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify(body)})
    .then(r=>r.json()).then(d=>{
      if(d.status==='ok')toast('Сохранено');
      else toast('Ошибка',true);
    }).catch(()=>toast('Нет связи',true));
}

// ── API viewer ────────────────────────────────────────────────────────
function refreshApiView(){
  fetch('/api/data').then(r=>r.json()).then(d=>{
    document.getElementById('api-json').textContent=JSON.stringify(d,null,2);
  }).catch(()=>{document.getElementById('api-json').textContent='Нет связи';});
}

// ── Dates init ────────────────────────────────────────────────────────
(function initDates(){
  const now=new Date();
  const fmt=d=>`${d.getFullYear()}-${String(d.getMonth()+1).padStart(2,'0')}-${String(d.getDate()).padStart(2,'0')}`;
  const today=fmt(now), weekAgo=fmt(new Date(now-7*86400000));
  ['exp-date-sd'].forEach(id=>{const el=document.getElementById(id);if(el)el.value=today;});
  document.getElementById('exp-from').value=weekAgo;
  document.getElementById('exp-to').value=today;
})();

// ── Auto refresh ───────────────────────────────────────────────────────
function autoRefresh(){
  _start=Date.now(); tickBar(); fetchData();
  setTimeout(autoRefresh,REFRESH);
}

// ── Archive ───────────────────────────────────────────────────────────
let _archInited=false;
let _archLastVisit=0;  // Unix-секунды последнего визита (для пресета "С прошлого визита")
function archFmtDate(d){const p=n=>String(n).padStart(2,'0');return d.getFullYear()+'-'+p(d.getMonth()+1)+'-'+p(d.getDate());}
function archFmtFriendly(d){
  const p=n=>String(n).padStart(2,'0');
  const now=new Date();
  const diffH=(now-d)/3600000;
  const date=p(d.getDate())+'.'+p(d.getMonth()+1)+'.'+d.getFullYear();
  const time=p(d.getHours())+':'+p(d.getMinutes());
  if(diffH<24)return 'сегодня в '+time;
  if(diffH<48)return 'вчера в '+time;
  const days=Math.floor(diffH/24);
  return date+' ('+days+' дн. назад)';
}
function archInit(){
  if(_archInited)return;
  _archInited=true;
  const today=new Date();
  // По умолчанию — последняя неделя (фоллбэк если /api/last-visit недоступен)
  const weekAgo=new Date(today.getTime()-6*86400000);
  document.getElementById('arch-from').value=archFmtDate(weekAgo);
  document.getElementById('arch-to').value=archFmtDate(today);
  // Подтягиваем "С прошлого визита" — если есть, переключаемся на него
  fetch('/api/last-visit').then(r=>r.json()).then(d=>{
    if(d&&d.lastVisit&&d.lastVisit>0){
      _archLastVisit=d.lastVisit;
      const visitDate=new Date(d.lastVisit*1000);
      document.getElementById('arch-since-btn').style.display='inline-block';
      document.getElementById('arch-last-visit-info').style.display='block';
      document.getElementById('arch-last-visit-info').textContent='Прошлый визит: '+archFmtFriendly(visitDate);
      // Если прошлый визит >1 дня назад — автоматически выставляем его как "с"
      const diffDays=(today-visitDate)/86400000;
      if(diffDays>=1){
        document.getElementById('arch-from').value=archFmtDate(visitDate);
        document.getElementById('arch-to').value=archFmtDate(today);
      }
    }
    archLoad();
  }).catch(()=>{archLoad();});
}
function archSinceLastVisit(){
  if(!_archLastVisit){toast('Нет данных о прошлом визите',true);return;}
  const visitDate=new Date(_archLastVisit*1000);
  const today=new Date();
  document.getElementById('arch-from').value=archFmtDate(visitDate);
  document.getElementById('arch-to').value=archFmtDate(today);
  archLoad();
}
function archPreset(daysBack){
  const today=new Date();
  document.getElementById('arch-to').value=archFmtDate(today);
  if(daysBack<0){document.getElementById('arch-from').value='';}
  else{const d=new Date(today.getTime()-daysBack*86400000);document.getElementById('arch-from').value=archFmtDate(d);}
  archLoad();
}
function archDownloadRange(){
  const f=document.getElementById('arch-from').value;
  const t=document.getElementById('arch-to').value;
  if(!f&&!t){toast('Выберите период',true);return;}
  const qs=[];if(f)qs.push('from='+f);if(t)qs.push('to='+t);
  window.open('/api/log?'+qs.join('&'),'_blank');
}
// Группировка записей по дате (DD.MM.YYYY) + расчёт min/max/средний вес и темп
function archGroup(rows){
  const days={};
  for(const r of rows){
    if(!r.dt||r.dt.length<10)continue;
    const day=r.dt.substring(0,10);
    if(!days[day])days[day]={day,entries:[],wMin:Infinity,wMax:-Infinity,tMin:Infinity,tMax:-Infinity,wFirst:r.w,wLast:r.w};
    const d=days[day];
    d.entries.push(r);
    if(r.w<d.wMin)d.wMin=r.w;
    if(r.w>d.wMax)d.wMax=r.w;
    if(r.t>-90){if(r.t<d.tMin)d.tMin=r.t;if(r.t>d.tMax)d.tMax=r.t;}
    d.wLast=r.w;
  }
  return Object.values(days).sort((a,b)=>{
    // DD.MM.YYYY → сравниваем как YYYYMMDD
    const ka=a.day.substring(6,10)+a.day.substring(3,5)+a.day.substring(0,2);
    const kb=b.day.substring(6,10)+b.day.substring(3,5)+b.day.substring(0,2);
    return kb.localeCompare(ka);  // новые сверху
  });
}
function archLoad(){
  const f=document.getElementById('arch-from').value;
  const t=document.getElementById('arch-to').value;
  const list=document.getElementById('arch-list');
  list.innerHTML='⏳ Загрузка...';
  document.getElementById('arch-summary').style.display='none';
  const qs=[];if(f)qs.push('from='+f);if(t)qs.push('to='+t);
  fetch('/api/period'+(qs.length?'?'+qs.join('&'):''))
    .then(r=>r.json())
    .then(rows=>{
      if(!rows||rows.length===0){list.innerHTML='<div style="color:var(--text3);padding:10px 0">Нет записей за выбранный период.</div>';return;}
      const days=archGroup(rows);
      // Сводка
      const sortedAsc=[...rows].sort((a,b)=>{
        const ka=a.dt.substring(6,10)+a.dt.substring(3,5)+a.dt.substring(0,2)+a.dt.substring(11);
        const kb=b.dt.substring(6,10)+b.dt.substring(3,5)+b.dt.substring(0,2)+b.dt.substring(11);
        return ka.localeCompare(kb);
      });
      const wFirst=sortedAsc[0].w,wLast=sortedAsc[sortedAsc.length-1].w;
      const delta=wLast-wFirst;
      document.getElementById('arch-range').textContent=sortedAsc[0].dt.substring(0,10)+' → '+sortedAsc[sortedAsc.length-1].dt.substring(0,10);
      document.getElementById('arch-count').textContent=rows.length+' (дней: '+days.length+')';
      const dEl=document.getElementById('arch-delta');
      dEl.textContent=(delta>=0?'+':'')+delta.toFixed(2)+' кг';
      dEl.style.color=delta>0?'var(--green)':(delta<-0.5?'var(--red)':'var(--text)');
      document.getElementById('arch-summary').style.display='block';
      // Получаем порог alert_delta из текущих настроек (для подсветки аномалий)
      const alertDelta=window._alertDeltaCache||1.0;
      // Рендерим список
      let html='';
      // Месячные группы
      let curMonth='';
      const monthNames=['Январь','Февраль','Март','Апрель','Май','Июнь','Июль','Август','Сентябрь','Октябрь','Ноябрь','Декабрь'];
      // Пересчитываем дельты день-к-дню (на отсортированном по возрастанию массиве)
      const daysAsc=[...days].reverse();
      for(let i=0;i<daysAsc.length;i++){
        if(i>0)daysAsc[i].deltaPrev=daysAsc[i].wLast-daysAsc[i-1].wLast;
        else daysAsc[i].deltaPrev=null;
      }
      // Рендер сверху вниз — новые первыми
      for(const d of days){
        const dt=d.day;
        const month=dt.substring(3,5),year=dt.substring(6,10);
        const monthKey=month+'/'+year;
        if(monthKey!==curMonth){
          curMonth=monthKey;
          html+='<div style="font-size:12px;color:var(--amber);margin:14px 0 6px;letter-spacing:1px">'+monthNames[parseInt(month)-1].toUpperCase()+' '+year+'</div>';
        }
        // Метка/цвет
        let marker='⚪';
        let markerColor='var(--text3)';
        if(d.deltaPrev!==null){
          if(d.deltaPrev<-alertDelta){marker='🔴';markerColor='var(--red)';}
          else if(d.deltaPrev>0.1){marker='🟢';markerColor='var(--green)';}
          else if(d.deltaPrev<-0.1){marker='🟡';markerColor='var(--amber)';}
        }
        // Дни недели
        const parts=dt.split('.');
        const jsDate=new Date(parts[2]+'-'+parts[1]+'-'+parts[0]);
        const dow=['Вс','Пн','Вт','Ср','Чт','Пт','Сб'][jsDate.getDay()];
        // Записи дня
        let entriesHtml='';
        for(const e of d.entries){
          const time=e.dt.substring(11,16);
          entriesHtml+='<div style="display:flex;justify-content:space-between;padding:3px 0;font-size:13px"><span style="color:var(--text2)">'+time+'</span><span><b>'+e.w.toFixed(2)+'</b> кг'+(e.t>-90?' · '+e.t.toFixed(1)+'°C':'')+'</span></div>';
        }
        const deltaText=d.deltaPrev===null?'':' <span style="color:'+(d.deltaPrev>=0?'var(--green)':'var(--red)')+';font-size:12px">('+(d.deltaPrev>=0?'+':'')+d.deltaPrev.toFixed(2)+' кг)</span>';
        html+='<div style="border-left:3px solid '+markerColor+';padding:8px 10px;margin-bottom:6px;background:var(--bg);border-radius:4px"><div style="display:flex;justify-content:space-between;align-items:center;margin-bottom:4px"><b>'+dt+' '+dow+' '+marker+'</b><span style="font-size:13px;color:var(--text2)">'+d.wLast.toFixed(2)+' кг'+deltaText+'</span></div>'+entriesHtml+'<div style="font-size:11px;color:var(--text3);margin-top:4px">Мин/Макс: '+d.wMin.toFixed(2)+'–'+d.wMax.toFixed(2)+' кг'+(d.tMin<Infinity?' · T: '+d.tMin.toFixed(1)+'–'+d.tMax.toFixed(1)+'°C':'')+'</div></div>';
      }
      list.innerHTML=html;
    })
    .catch(()=>{list.innerHTML='<div style="color:var(--red);padding:10px 0">Ошибка загрузки</div>';});
  // Параллельно подтягиваем alertDelta из /api/config (один раз)
  if(!window._alertDeltaCache){
    fetch('/api/config').then(r=>r.json()).then(c=>{window._alertDeltaCache=c.alertDelta||1.0;}).catch(()=>{});
  }
}

// ── PWA: service worker registration ──────────────────────────────────
if('serviceWorker' in navigator){
  window.addEventListener('load',()=>{
    navigator.serviceWorker.register('/sw.js').catch(()=>{});
  });
}

// ── Init ──────────────────────────────────────────────────────────────
updateWiz();
fetchData();
setTimeout(autoRefresh,REFRESH);
</script>
</body></html>

)rawhtml";

// Настройки читаются/записываются через Memory.h (web_get_*/save_web_settings)

// Маскировка секретов: XXXX***YYYY — всегда 4 первых + 4 последних символа реального src,
// середина ровно 3 звёздочки. Безопасно для произвольно длинных строк (TG-токен ~46 байт).
static String _maskSecret(const char *src) {
  if (!src) return "";
  size_t len = strlen(src);
  if (len == 0) return "";
  if (len <= 8) return "****";
  char buf[16];
  snprintf(buf, sizeof(buf), "%c%c%c%c***%c%c%c%c",
           src[0], src[1], src[2], src[3],
           src[len-4], src[len-3], src[len-2], src[len-1]);
  return String(buf);
}

// ─── Uptime в читаемом виде ───────────────────────────────────────────────
static String _uptime() {
  unsigned long s = millis() / 1000UL;
  char buf[16];
  snprintf(buf, sizeof(buf), "%lud%02lu:%02lu:%02lu",
           s/86400, (s%86400)/3600, (s%3600)/60, s%60);
  return String(buf);
}

// _buildPage() удалён — страница полностью статическая, данные через AJAX

