darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
// ─── JSON ответ ───────────────────────────────────────────────────────────
static void _sendJson(bool ok, const String &msg) {
  StaticJsonDocument<128> doc;
  doc["ok"]  = ok;
  doc["msg"] = msg;
  String out; serializeJson(doc, out);
  _srv.send(ok ? 200 : 400, "application/json", out);
}

// ─── Маршруты ─────────────────────────────────────────────────────────────
static inline void _activity() {
  lastActivityTime = millis();
  if (_wa.onActivity) _wa.onActivity();
}
static inline void _keepalive() {
  // GET-поллинг НЕ сбрасывает таймер авто-сна — иначе deep sleep никогда не сработает
}

// Отправка PROGMEM-строки чанками (без копирования всего в heap)
static void _sendProgmemChunked(const char *pgm) {
  if (!pgm) { _srv.send(500, "text/plain", "No content"); return; }
  _srv.setContentLength(CONTENT_LENGTH_UNKNOWN);
  _srv.send(200, "text/html; charset=utf-8", "");
  size_t total = strlen_P(pgm);
  size_t sent = 0;
  // 4KB чанки (было 512) — на странице ~70КБ это уменьшает кол-во TCP-пакетов
  // и yield()-ов в ~8 раз. На слабом WiFi это сокращает загрузку HTML с 30+ сек до 3-5 сек.
  static char chunk[4096];  // static чтобы не жечь стек
  while (sent < total) {
    size_t n = min((size_t)sizeof(chunk), total - sent);
    memcpy_P(chunk, pgm + sent, n);
    _srv.sendContent(chunk, n);
    yield();
    sent += n;
  }
}

static void _handleRoot() {
  if (!_auth()) return;
  _activity();
  _sendProgmemChunked(PAGE_HTML);
}

// ─── /api/config  GET — начальные значения для форм настроек ─────────────
static void _handleConfig() {
  if (!_auth()) return;
  _keepalive();  // GET-поллинг — не сбрасывать таймер авто-сна
  StaticJsonDocument<640> doc;
  doc["alertDelta"]  = web_get_alert_delta();
  doc["calibWeight"] = web_get_calib_weight();
  doc["emaAlpha"]    = web_get_ema_alpha();
  doc["sleepSec"]    = (unsigned long)get_sleep_sec();
  doc["lcdBlSec"]    = (unsigned int)get_lcd_bl_sec();
  doc["autoSleepSec"] = (unsigned int)get_autosleep_sec();
  doc["wifiMode"]    = (int)get_wifi_mode();
  // НЕ использовать block scope для char-буферов + ArduinoJson!
  // ArduinoJson v6 для char* хранит указатель (zero-copy) — dangling pointer если буфер на стеке.
  // Оборачиваем в String() чтобы ArduinoJson скопировал содержимое.
  {
    char ss[33]; get_wifi_ssid(ss, sizeof(ss));
    doc["wifiSsid"] = String(ss);
  }
  {
    char tgTok[50], tgCid[16];
    get_tg_token(tgTok, sizeof(tgTok));
    get_tg_chatid(tgCid, sizeof(tgCid));
    doc["tgToken"]  = _maskSecret(tgTok);
    doc["tgChatId"] = String(tgCid);
    doc["tgTokenSet"] = (tgTok[0] != '\0');
    doc["tgReportInt"] = get_tg_report_interval_min();
  }
  {
    uint16_t times[8]; uint8_t cnt;
    get_sched_times(times, cnt);
    JsonArray arr = doc.createNestedArray("schedTimes");
    char tbuf[6];
    for (uint8_t i = 0; i < cnt; i++) {
      snprintf(tbuf, sizeof(tbuf), "%02d:%02d", times[i] / 60, times[i] % 60);
      arr.add(String(tbuf));
    }
  }
  String out; serializeJson(doc, out);
  _srv.send(200, "application/json", out);
}

static void _handleData() {
  if (!_auth()) return;
  static unsigned long _lastDataReq = 0;
  if (!_rate_limit(_lastDataReq, 1000UL)) return;
  _keepalive();  // поллинг — не сбрасывать подсветку
  if (_csrfToken[0] == '\0') _csrf_init();
  StaticJsonDocument<512> doc;
  doc["weight"]   = *_wd.weight;
  doc["ref"]      = *_wd.lastSavedWeight;
  doc["prev"]     = *_wd.prevWeight;
  doc["lastRep"]  = _wd.lastReportWeight ? *_wd.lastReportWeight : 0.0f;
  doc["hasRep"]   = _wd.hasLastReport ? *_wd.hasLastReport : false;
  doc["prevDate"] = (uint32_t)load_prev_weight_date();  // Unix timestamp фиксации
  doc["temp"]     = *_wd.tempC;
  doc["rtcT"]     = *_wd.rtcTempC;
  doc["sensor"]   = *_wd.sensorReady;
  doc["wifi"]     = *_wd.wifiOk;
  doc["datetime"] = *_wd.datetime;
  doc["uptime"]   = _uptime();
  doc["wakeups"]  = *_wd.wakeupCount;
  doc["cf"]       = *_wd.calibFactor;
  doc["offset"]   = *_wd.offset;
  doc["batV"]     = *_wd.batVoltage;
  doc["batPct"]   = *_wd.batPercent;
  // SD-статистика: LittleFS.usedBytes()/totalBytes() итерирует все файлы → медленно.
  // Кешируем на 10 сек чтобы поллинг /api/data был быстрым (~5мс вместо 100-500мс).
  static unsigned long _sdStatsLastMs = 0;
  static unsigned long _sdLogCache = 0, _sdFreeCache = 0;
  static bool _sdFallbackCache = false, _sdOkCache = false;
  if (_sdStatsLastMs == 0 || (millis() - _sdStatsLastMs) > 10000UL) {
    _sdLogCache      = (unsigned long)log_size();
    _sdFreeCache     = (unsigned long)log_free_space();
    _sdFallbackCache = log_using_fallback();
    _sdOkCache       = log_fs_ok();
    _sdStatsLastMs   = millis();
    if (_sdStatsLastMs == 0) _sdStatsLastMs = 1;
  }
  doc["sdLog"]      = _sdLogCache;
  doc["sdFree"]     = _sdFreeCache;
  doc["sdFallback"] = _sdFallbackCache;
  doc["sdOk"]       = _sdOkCache ? 1 : 0;
  doc["csrf"]         = _csrfToken;
  doc["credsDefault"] = credentials_is_default();
  doc["fw"]           = FW_VERSION;
  // Оставшееся время web-продления (секунды). 0 = продление не активно
  if (extendSleepUntilMs != 0) {
    long left = (long)(extendSleepUntilMs - millis());
    doc["keepLeftSec"] = (left > 0) ? (left / 1000) : 0;
  } else {
    doc["keepLeftSec"] = 0;
  }
#if defined(ESP32) || defined(ESP8266)
  doc["heap"]     = ESP.getFreeHeap();
#else
  doc["heap"]     = 0;
#endif
  String out; serializeJson(doc, out);
  _srv.send(200, "application/json", out);
}

static void _handleTare() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  _activity();
  if (_wa.doTare) { _wa.doTare(); _sendJson(true, "Тарировка выполнена"); }
  else _sendJson(false, "Нет обработчика");
}

static void _handleSave() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  _activity();
  if (_wa.doSave) { _wa.doSave(); _sendJson(true, "Эталон сохранён"); }
  else _sendJson(false, "Нет обработчика");
}

// POST /api/keepalive — продлить работу на 10 минут (отодвигает auto-sleep)
static void _handleKeepAlive() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  _activity();
  extendSleepUntilMs = millis() + 10UL * 60UL * 1000UL;
  if (extendSleepUntilMs == 0) extendSleepUntilMs = 1;  // 0 = "неактивно", избегаем коллизии при rollover
  _sendJson(true, "Продлено на 10 мин");
}

// Forward declaration — используется в авто-бэкапе при сохранении настроек
// masked=true: секреты замаскированы (для GET /api/backup), false: полные (для SD-файла)
static String _buildBackupJson(bool masked = false);

static void _handleSettings() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  if (_srv.method() != HTTP_POST) { _sendJson(false,"Только POST"); return; }
  _activity();
  StaticJsonDocument<512> doc;
  DeserializationError err = deserializeJson(doc, _srv.arg("plain"));
  if (err) { _sendJson(false,"Ошибка JSON"); return; }

  // Валидация входных данных
  float newAlert  = web_get_alert_delta();
  float newCalib  = web_get_calib_weight();
  float newAlpha  = web_get_ema_alpha();

  if (doc.containsKey("alertDelta")) {
    float val = doc["alertDelta"].as<float>();
    if (val >= 0.1f && val <= 10.0f) {
      newAlert = val;
    } else {
      _sendJson(false, "alertDelta должен быть от 0.1 до 10.0 кг");
      return;
    }
  }

  if (doc.containsKey("calibWeight")) {
    float val = doc["calibWeight"].as<float>();
    if (val >= 100.0f && val <= 50000.0f) {
      newCalib = val;
    } else {
      _sendJson(false, "calibWeight должен быть от 100 до 50000 г");
      return;
    }
  }

  if (doc.containsKey("emaAlpha")) {
    float val = doc["emaAlpha"].as<float>();
    if (val >= 0.05f && val <= 0.9f) {
      newAlpha = val;
    } else {
      _sendJson(false, "emaAlpha должен быть от 0.05 до 0.9");
      return;
    }
  }

