darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
  // Валидация расширенных настроек ДО записи
  uint32_t newSleepSec = 0; bool hasSleepSec = false;
  uint16_t newLcdBlSec = 0;  bool hasLcdBlSec = false;
  const char* newApPass = nullptr;
  if (doc.containsKey("sleepSec")) {
    uint32_t val = doc["sleepSec"].as<uint32_t>();
    if (val >= 30UL && val <= 86400UL) { newSleepSec = val; hasSleepSec = true; }
    else { _sendJson(false, "sleepSec: 30–86400"); return; }
  }
  if (doc.containsKey("lcdBlSec")) {
    uint16_t val = doc["lcdBlSec"].as<uint16_t>();
    if (val <= 3600) { newLcdBlSec = val; hasLcdBlSec = true; }
    else { _sendJson(false, "lcdBlSec: 0–3600"); return; }
  }
  if (doc.containsKey("autoSleepSec")) {
    uint32_t val = doc["autoSleepSec"].as<uint32_t>();
    if (val <= 86400UL) { set_autosleep_sec((uint16_t)val); }
    else { _sendJson(false, "autoSleepSec: 0–86400"); return; }
  }
  char apPassBuf[24];  // локальная — безопасно при параллельных запросах (пункт 20)
  apPassBuf[0] = '\0';
  if (doc.containsKey("apPass")) {
    const char* pass = doc["apPass"].as<const char*>();
    if (pass && strlen(pass) >= 8 && strlen(pass) <= 23) {
      strncpy(apPassBuf, pass, sizeof(apPassBuf) - 1);
      apPassBuf[sizeof(apPassBuf) - 1] = '\0';
      newApPass = apPassBuf;
    }
    else { _sendJson(false, "apPass: 8–23 символа"); return; }
  }

  // Все поля валидны — сохраняем в EEPROM
  save_web_settings(newAlert, newCalib, newAlpha);
  // Batch: ext settings — один commit вместо 3 отдельных
  if (hasSleepSec || hasLcdBlSec || newApPass) {
    set_ext_all(
      hasSleepSec ? newSleepSec : get_sleep_sec(),
      hasLcdBlSec ? newLcdBlSec : get_lcd_bl_sec(),
      newApPass
    );
  }
  if (doc.containsKey("schedTimes")) {
    JsonArray arr = doc["schedTimes"].as<JsonArray>();
    uint16_t times[8]; uint8_t cnt = 0;
    for (JsonVariant v : arr) {
      const char* s = v.as<const char*>();
      if (!s) continue;
      int h = 0, m = 0;
      if (sscanf(s, "%d:%d", &h, &m) == 2 && h >= 0 && h <= 23 && m >= 0 && m <= 59) {
        if (cnt < 8) times[cnt++] = (uint16_t)h * 60 + m;
      }
    }
    set_sched_times(times, cnt);
  }

  // Авто-бэкап на SD при изменении настроек
  log_save_backup(_buildBackupJson());

  _sendJson(true, "Сохранено");
}

static void _handleReboot() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  // Отправляем JSON целиком и даём TCP время выпихнуть данные до сокета клиента.
  // client().stop() здесь ЗАПРЕЩЁН — обрубит сокет до того как клиент прочитает body.
  _sendJson(true, "Перезагрузка...");
  _srv.client().flush();
  delay(200);
  ESP.restart();
}

// Обработчик NTP синхронизации
static void _handleNtp() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  _activity();
  if (_srv.method() != HTTP_POST) { _sendJson(false,"Только POST"); return; }

  Serial.println(F("[Web] NTP sync requested..."));

  if (ntp_sync_time()) {
    _sendJson(true, "Время синхронизировано");
  } else {
    _sendJson(false, "Ошибка синхронизации");
  }
}

static void _handleChart() {
  if (!_auth()) return;
  _activity();
  _sendProgmemChunked(PAGE_HTML);
}

static void _handleWifi() {
  if (!_auth()) return;
  _activity();
  _sendProgmemChunked(PAGE_HTML);
}

// ─── /api/tg/settings  POST — сохранить Telegram токен и chat_id ─────────
static void _handleTgSettings() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  _activity();
  if (_srv.method() != HTTP_POST) { _sendJson(false,"Только POST"); return; }
  StaticJsonDocument<256> doc;
  DeserializationError err = deserializeJson(doc, _srv.arg("plain"));
  if (err) { _sendJson(false,"Ошибка JSON"); return; }
  // Batch: собираем token и chatId, один commit через set_tg_all()
  const char* newToken = NULL;
  const char* newChatId = NULL;
  if (doc.containsKey("token")) {
    const char* t = doc["token"].as<const char*>();
    if (t && strlen(t) > 0 && strlen(t) < 50 && strchr(t, '*') == NULL) newToken = t;
    else if (t && strlen(t) == 0) newToken = "";
  }
  if (doc.containsKey("chatId")) {
    const char* c = doc["chatId"].as<const char*>();
    if (c && strlen(c) < 16) newChatId = c;
  }
  if (newToken || newChatId) set_tg_all(newToken, newChatId);
  if (doc.containsKey("reportInt")) {
    uint32_t v = doc["reportInt"].as<uint32_t>();
    // 0 = откл, минимум 60 мин, максимум 10080 (7 дней)
    if (v == 0 || (v >= 60 && v <= 10080)) set_tg_report_interval_min(v);
  }
  log_save_backup(_buildBackupJson());
  _sendJson(true, "Telegram настройки сохранены");
}

// ─── /api/tg/test  POST — отправить тестовое/приветственное сообщение ────
static void _handleTgTest() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  _activity();

  // Справка: что бот присылает и как настроить
  char info[1024];
  uint32_t rptMin = get_tg_report_interval_min();
  float alertKg = web_get_alert_delta();
  snprintf(info, sizeof(info),
    "🐝 <b>" FW_NAME " v" FW_VERSION "</b>\n\n"
    "<b>Что присылает:</b>\n"
    "• <b>Отчёт</b> — вес, температура (по расписанию или каждые %lu мин%s)\n"
    "• <b>Тревога</b> — при изменении веса на %.1f+ кг (пауза 30 мин)\n\n"
    "<b>Веб-панель:</b> http://192.168.4.1\n"
    "• Подключение к Wi-Fi роутеру\n"
    "• Интервал отчётов, порог тревоги\n"
    "• Расписание замеров (например 09:00 21:00)\n"
    "• Графики, экспорт CSV, калибровка",
    (unsigned long)(rptMin ? rptMin : 0),
    rptMin ? "" : ", выкл",
    alertKg);

  bool ok = tg_send_message(info);
  _sendJson(ok, ok ? "Сообщение отправлено" : "Ошибка отправки (проверьте token/chat_id)");
}

// ─── /api/calib/set  POST — установить cal.factor и offset ───────────────
static void _handleCalibSet() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  _activity();
  if (_srv.method() != HTTP_POST) { _sendJson(false,"Только POST"); return; }
  StaticJsonDocument<128> doc;
  DeserializationError err = deserializeJson(doc, _srv.arg("plain"));
  if (err) { _sendJson(false,"Ошибка JSON"); return; }
  bool changed = false;
  if (doc.containsKey("calibFactor") && _wa.doSetCalibFactor) {
    float cf = doc["calibFactor"].as<float>();
    if (cf >= 100.0f && cf <= 100000.0f) {
      _wa.doSetCalibFactor(cf);
      changed = true;
    } else { _sendJson(false,"calibFactor: 100–100000"); return; }
  }
  if (doc.containsKey("offset") && _wa.doSetCalibOffset) {
    long ofs = doc["offset"].as<long>();
    _wa.doSetCalibOffset(ofs);
    changed = true;
  }
  if (changed) { log_save_backup(_buildBackupJson()); _sendJson(true, "Калибровка обновлена"); }
  else _sendJson(false, "Нет данных для обновления");
}

// ─── /api/wifi/settings  POST — сохранить режим WiFi и credentials ──────
static void _handleWifiSettings() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  _activity();
  if (_srv.method() != HTTP_POST) { _sendJson(false,"Только POST"); return; }
  StaticJsonDocument<256> doc;
  DeserializationError err = deserializeJson(doc, _srv.arg("plain"));
  if (err) { _sendJson(false,"Ошибка JSON"); return; }
  if (!doc.containsKey("wifiMode")) { _sendJson(false,"Нет wifiMode"); return; }
  uint8_t mode = doc["wifiMode"].as<uint8_t>();
  if (mode > 1) { _sendJson(false,"wifiMode: 0 или 1"); return; }
  // Batch: один commit через set_wifi_all() вместо 3 отдельных
  const char *ssid = NULL;
  const char *pass = NULL;
  if (mode == 1) {
    ssid = doc["wifiSsid"].as<const char*>();
    pass = doc["wifiPass"].as<const char*>();
    if (!ssid || strlen(ssid) == 0) { _sendJson(false,"Введите SSID роутера"); return; }
    if (strlen(ssid) > 32) { _sendJson(false,"SSID слишком длинный (макс 32)"); return; }
    if (pass && strlen(pass) > 32) { _sendJson(false,"Пароль слишком длинный (макс 32)"); return; }
  }
  set_wifi_all(mode, ssid, pass);
  log_save_backup(_buildBackupJson());
  _sendJson(true, "WiFi настройки сохранены, перезагрузка...");
  _srv.client().flush();
  delay(200);
  ESP.restart();
}

static void _handleNotFound() {
  _srv.send(404, "text/plain", "Not found");
}

// ─── /api/auth/password  POST — смена admin login/пароля ─────────────────
// Body: { "user": "newlogin", "pass": "newpass" }  (user опционален)
static void _handleAuthPassword() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  if (_srv.method() != HTTP_POST) { _sendJson(false, "Только POST"); return; }
  _activity();
  StaticJsonDocument<192> doc;
  DeserializationError err = deserializeJson(doc, _srv.arg("plain"));
  if (err) { _sendJson(false, "Ошибка JSON"); return; }
  const char* u = doc["user"].as<const char*>();
  const char* p = doc["pass"].as<const char*>();
  if (!p || strlen(p) < 6 || strlen(p) > 31) {
    _sendJson(false, "Пароль: 6-31 символ");
    return;
  }
  if (u && (strlen(u) < 3 || strlen(u) > 23)) {
    _sendJson(false, "Логин: 3-23 символа");
    return;
  }
  set_admin_credentials(u, p);
  _sendJson(true, "Учётные данные обновлены. Переавторизация при следующем запросе.");
}

// ─── /api/auth/ota  POST — смена OTA пароля ──────────────────────────────
static void _handleAuthOta() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  if (_srv.method() != HTTP_POST) { _sendJson(false, "Только POST"); return; }
  _activity();
  StaticJsonDocument<128> doc;
  DeserializationError err = deserializeJson(doc, _srv.arg("plain"));
  if (err) { _sendJson(false, "Ошибка JSON"); return; }
  const char* p = doc["pass"].as<const char*>();
  if (!p || strlen(p) < 6 || strlen(p) > 31) {
    _sendJson(false, "OTA пароль: 6-31 символ");
    return;
  }
  set_ota_pass(p);
  _sendJson(true, "OTA пароль сохранён. Вступит в силу после перезагрузки.");
}

// ─── Stream-обёртка над WebServerCompat (для chunked transfer без heap-аккумуляции) ─
class _WebChunkStream : public Stream {
public:
  WebServerCompat &srv;
  char buf[256];
  uint16_t pos;
  _WebChunkStream(WebServerCompat &s) : srv(s), pos(0) {}
  size_t write(uint8_t c) override {
    buf[pos++] = (char)c;
    if (pos >= sizeof(buf)) _flush_buf();
    return 1;
  }
  size_t write(const uint8_t *b, size_t s) override {
    size_t sent = 0;
    while (sent < s) {
      size_t n = (s - sent > 512) ? 512 : (s - sent);
      if (pos > 0) _flush_buf();
      srv.sendContent((const char*)(b + sent), n);
      sent += n;
      yield();
    }
    return s;
  }
  void _flush_buf() { if (pos > 0) { srv.sendContent(buf, pos); pos = 0; } }
  int available() override { return 0; }
  int read()      override { return -1; }
  int peek()      override { return -1; }
  void flush()    override { _flush_buf(); }
};

// ─── /api/log  GET — скачать CSV-лог (опционально: ?date=YYYY-MM-DD или ?from=&to=) ─
static void _handleLog() {
  if (!_auth()) return;
  static unsigned long _lastLogCsvReq = 0;
  if (!_rate_limit(_lastLogCsvReq, 1000UL)) return;
  _activity();
  if (!log_exists()) {
    _srv.send(404, "text/plain", "Log not found");
    return;
  }
  String date = _srv.arg("date");  // "" если параметр не передан
  String dFrom = _srv.arg("from");
  String dTo   = _srv.arg("to");
  // Санитизация всех 3 параметров: только цифры, '-' и '.', длина ≤10
  auto sanitizeDate = [](String &d) -> bool {
    if (d.length() == 0) return true;
    if (d.length() > 10) d = d.substring(0, 10);
    for (unsigned int i = 0; i < d.length(); i++) {
      char ch = d[i];
      if (!isdigit(ch) && ch != '-' && ch != '.') return false;
    }
    return true;
  };
  if (!sanitizeDate(date) || !sanitizeDate(dFrom) || !sanitizeDate(dTo)) {
    _srv.send(400, "text/plain", "Bad date");
    return;
  }
  // Если задан диапазон from/to — приоритет над date
  if (dFrom.length() > 0 || dTo.length() > 0) {
    String fname = "beehive_" +
                   (dFrom.length() ? dFrom : String("start")) + "_" +
                   (dTo.length()   ? dTo   : String("end"))   + ".csv";
    _srv.sendHeader("Content-Disposition", "attachment; filename=\"" + fname + "\"");
    _srv.setContentLength(CONTENT_LENGTH_UNKNOWN);
    _srv.send(200, "text/csv; charset=utf-8", "");
    _WebChunkStream cs(_srv);
    log_stream_csv_range(cs, dFrom, dTo);
    cs.flush();
    return;
  }
  if (date.length() == 0) {
    // Без фильтра — стримим весь файл напрямую
    File f;
#ifdef USE_SD_CARD
    if (log_using_fallback()) {
      f = LittleFS.open(LOG_FILE, "r");
    } else {
      f = SD.open(LOG_FILE, FILE_READ);
    }
#else
    f = LOG_FS.open(LOG_FILE, "r");
#endif
    if (!f) { _srv.send(500, "text/plain", "Cannot open log"); return; }
    _srv.sendHeader("Content-Disposition", "attachment; filename=\"beehive_log.csv\"");
    _srv.streamFile(f, "text/csv");
    f.close();
  } else {
    // С фильтром по дате — стримим чанками (chunked transfer) для экономии heap
    String fname = "beehive_" + date + ".csv";
    _srv.sendHeader("Content-Disposition", "attachment; filename=\"" + fname + "\"");
    _srv.setContentLength(CONTENT_LENGTH_UNKNOWN);
    _srv.send(200, "text/csv; charset=utf-8", "");
    _WebChunkStream cs(_srv);
    log_stream_csv_date(cs, date);
    cs.flush();
  }
}

// ─── /api/period  GET — JSON записей за диапазон ?from=&to= ──────────────
// Для страницы "Архив": клиент группирует по датам и рисует ленту.
static void _handlePeriod() {
  if (!_auth()) return;
  static unsigned long _lastPeriodReq = 0;
  if (!_rate_limit(_lastPeriodReq, 1000UL)) return;
  _activity();
  if (!log_exists()) {
    _srv.send(200, "application/json", "[]");
    return;
  }
  String dFrom = _srv.arg("from");
  String dTo   = _srv.arg("to");
  auto sanitizeDate = [](String &d) -> bool {
    if (d.length() == 0) return true;
    if (d.length() > 10) d = d.substring(0, 10);
    for (unsigned int i = 0; i < d.length(); i++) {
      char ch = d[i];
      if (!isdigit(ch) && ch != '-' && ch != '.') return false;
    }
    return true;
  };
  if (!sanitizeDate(dFrom) || !sanitizeDate(dTo)) {
    _srv.send(400, "text/plain", "Bad date");
    return;
  }
  _srv.setContentLength(CONTENT_LENGTH_UNKNOWN);
  _srv.send(200, "application/json", "");
  _WebChunkStream cs(_srv);
  log_stream_period_json(cs, dFrom, dTo);
  cs.flush();
}

// ─── /manifest.json  GET — PWA-манифест ──────────────────────────────────
static void _handleManifest() {
  _activity();
  static const char MANIFEST[] PROGMEM =
    "{\"name\":\"BeehiveScale\",\"short_name\":\"Beehive\","
    "\"start_url\":\"/\",\"display\":\"standalone\",\"orientation\":\"portrait\","
    "\"background_color\":\"#0d0f0b\",\"theme_color\":\"#f5a623\","
    "\"description\":\"Пчеловодные весы — мониторинг улья\","
    "\"icons\":[{\"src\":\"/icon.svg\",\"sizes\":\"any\",\"type\":\"image/svg+xml\",\"purpose\":\"any maskable\"}]}";
  _srv.send_P(200, "application/manifest+json", MANIFEST);
}

// ─── /icon.svg  GET — иконка приложения (SVG для PWA-манифеста) ─────────
// v5.0.18: новая минималистичная иконка по образу Gemini-сгенерированной
// (icon.png в docs/assets/) — стилизованная пчела на медовом скруглённом квадрате.
static void _handleIcon() {
  static const char ICON_SVG[] PROGMEM =
    "<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 192 192\">"
    // Медовый скруглённый квадрат (фон)
    "<rect width=\"192\" height=\"192\" rx=\"36\" fill=\"#f5a623\"/>"
    // Тонкое внутреннее свечение (более тёмный круг для глубины)
    "<circle cx=\"96\" cy=\"100\" r=\"72\" fill=\"#e8901a\" opacity=\"0.5\"/>"
    // Антенны пчелы
    "<path d=\"M86 52 Q82 42 78 38\" stroke=\"#1a1a1a\" stroke-width=\"3.5\" fill=\"none\" stroke-linecap=\"round\"/>"
    "<path d=\"M106 52 Q110 42 114 38\" stroke=\"#1a1a1a\" stroke-width=\"3.5\" fill=\"none\" stroke-linecap=\"round\"/>"
    "<circle cx=\"78\" cy=\"38\" r=\"3.5\" fill=\"#1a1a1a\"/>"
    "<circle cx=\"114\" cy=\"38\" r=\"3.5\" fill=\"#1a1a1a\"/>"
    // Голова пчелы (круглая)
    "<circle cx=\"96\" cy=\"62\" r=\"14\" fill=\"#1a1a1a\"/>"
    // Тельце пчелы (овал)
    "<ellipse cx=\"96\" cy=\"110\" rx=\"20\" ry=\"32\" fill=\"#1a1a1a\"/>"
    // Полоски на тельце (медовые контрастные)
    "<rect x=\"76\" y=\"96\" width=\"40\" height=\"5\" fill=\"#f5a623\"/>"
    "<rect x=\"76\" y=\"112\" width=\"40\" height=\"5\" fill=\"#f5a623\"/>"
    "<rect x=\"78\" y=\"128\" width=\"36\" height=\"5\" fill=\"#f5a623\"/>"
    // Жало (внизу)
    "<path d=\"M92 140 L96 150 L100 140 Z\" fill=\"#1a1a1a\"/>"
    // Левое крыло (белое полупрозрачное)
    "<ellipse cx=\"68\" cy=\"82\" rx=\"22\" ry=\"14\" fill=\"#ffffff\" opacity=\"0.92\" transform=\"rotate(-15 68 82)\"/>"
    // Правое крыло (белое полупрозрачное)
    "<ellipse cx=\"124\" cy=\"82\" rx=\"22\" ry=\"14\" fill=\"#ffffff\" opacity=\"0.92\" transform=\"rotate(15 124 82)\"/>"
    // Платформа-весы под пчелой
    "<rect x=\"72\" y=\"154\" width=\"48\" height=\"5\" rx=\"2\" fill=\"#1a1a1a\"/>"
    "</svg>";
  _srv.sendHeader("Cache-Control", "public, max-age=2592000");
  _srv.send_P(200, "image/svg+xml", ICON_SVG);
}

// ─── /sw.js  GET — service worker для PWA (offline-кеш) ──────────────────
static void _handleServiceWorker() {
  // Кеш: главная страница + manifest + icon. API-запросы НЕ кешируем — нужны свежие данные.
  // При оффлайне: страница и иконка работают; данные грузятся как только Wi-Fi появится.
  static const char SW_JS[] PROGMEM =
    "const C='beehive-v1';"
    "const A=['/','/manifest.json','/icon.svg'];"
    "self.addEventListener('install',e=>{"
      "e.waitUntil(caches.open(C).then(c=>c.addAll(A)).then(()=>self.skipWaiting()));"
    "});"
    "self.addEventListener('activate',e=>{"
      "e.waitUntil(caches.keys().then(ks=>Promise.all(ks.filter(k=>k!==C).map(k=>caches.delete(k)))).then(()=>self.clients.claim()));"
    "});"
    "self.addEventListener('fetch',e=>{"
      "const u=new URL(e.request.url);"
      // API-запросы — только сеть (свежие данные)
      "if(u.pathname.startsWith('/api/')){return;}"
      // Прочее — сеть с фоллбэком на кеш
      "e.respondWith(fetch(e.request).then(r=>{"
        "if(r&&r.status===200&&e.request.method==='GET'){"
          "const cp=r.clone();caches.open(C).then(c=>c.put(e.request,cp));"
        "}"
        "return r;"
      "}).catch(()=>caches.match(e.request).then(m=>m||caches.match('/'))));"
    "});";
  _srv.sendHeader("Cache-Control", "no-cache");
  _srv.send_P(200, "application/javascript", SW_JS);
}

// ─── /archive  GET — alias на главный SPA (раздел "Архив") ──────────────
static void _handleArchive() {
  if (!_auth()) return;
  _activity();
  _sendProgmemChunked(PAGE_HTML);
}

// ─── /api/last-visit  GET — Unix timestamp прошлого визита + обновление ──
// Семантика: первый вызов за boot возвращает СТАРОЕ значение (то что хочет видеть
// пользователь в пресете "С прошлого визита"). Если прошло >1 часа с прошлого
// визита — EEPROM обновляется на "сейчас" (фиксируем новый визит).
// Все последующие вызовы в той же сессии возвращают ту же кешированную старую
// величину, чтобы повторное открытие вкладки "Архив" не сбрасывало пресет на
// "только что". При power-cycle кеш сбрасывается — нормально, визиты редки.
static uint32_t _lastVisitCached = 0;
static bool     _lastVisitInited = false;

static void _handleLastVisit() {
  if (!_auth()) return;
  _activity();

  // Текущее время из RTC (Unix epoch)
  uint32_t now = 0;
  TimeStamp ts = rtc_now();
  if (ts.valid) {
    DateTime dt(ts.year, ts.month, ts.day, ts.hour, ts.minute, ts.second);
    now = dt.unixtime();
  }

  if (!_lastVisitInited) {
    _lastVisitInited = true;
    _lastVisitCached = load_last_visit();
    // Если есть валидное "сейчас" — обновляем EEPROM при достаточном разрыве
    // (>1 часа) либо если ранее не было записи.
    if (now >= 1546300800UL) {
      bool needUpdate = false;
      if (_lastVisitCached == 0) needUpdate = true;
      else if (now > _lastVisitCached && (now - _lastVisitCached) > 3600UL) needUpdate = true;
      if (needUpdate) save_last_visit(now);
    }
  }

  StaticJsonDocument<128> doc;
  doc["lastVisit"] = _lastVisitCached;  // 0 если ни разу не было визитов
  doc["serverNow"] = now;               // 0 если RTC не готов
  String out; serializeJson(doc, out);
  _srv.send(200, "application/json", out);
}

// ─── /api/battery/calib  GET/POST — калибровка делителя батареи (v5.0.19) ─
// GET  → возвращает текущий ratio + сырое напряжение ADC + рассчитанное напряжение
// POST → принимает либо ratio (точный коэф), либо realVoltage (авто-расчёт)
static void _handleBatteryCalib() {
  if (!_auth()) return;
  _activity();

  if (_srv.method() == HTTP_GET) {
    StaticJsonDocument<192> doc;
    float adcV = bat_read_raw_adc_voltage();
    float ratio = bat_get_ratio();
    doc["ratio"]    = ratio;
    doc["adcV"]     = adcV;             // напряжение на пине ESP32 (до умножения)
    doc["batV"]     = adcV * ratio;     // итоговое (равно bat_voltage без сглаживания)
    doc["smoothed"] = bat_voltage();    // что прошивка показывает в UI (с EMA)
    String out; serializeJson(doc, out);
    _srv.send(200, "application/json", out);
    return;
  }

  if (_srv.method() == HTTP_POST) {
    if (!_csrf_check()) return;
    if (!_srv.hasArg("plain")) { _srv.send(400, "text/plain", "No body"); return; }

    StaticJsonDocument<128> in;
    DeserializationError err = deserializeJson(in, _srv.arg("plain"));
    if (err) { _srv.send(400, "text/plain", "Bad JSON"); return; }

    float newRatio = 0.0f;
    if (in.containsKey("ratio")) {
      // Точный ввод: пользователь сам подбирает коэффициент
      newRatio = in["ratio"].as<float>();
    } else if (in.containsKey("realVoltage")) {
      // Авто-расчёт: пользователь ввёл реальное напряжение с мультиметра
      float real = in["realVoltage"].as<float>();
      float adcV = bat_read_raw_adc_voltage();
      if (adcV < 0.1f || isnan(adcV) || isnan(real)) {
        _srv.send(400, "text/plain", "ADC reading invalid");
        return;
      }
      if (real < 1.5f || real > 5.5f) {
        _srv.send(400, "text/plain", "Real voltage out of range (1.5-5.5V expected)");
        return;
      }
      newRatio = real / adcV;
    } else {
      _srv.send(400, "text/plain", "Need 'ratio' or 'realVoltage'");
      return;
    }

