darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
    if (isnan(newRatio) || newRatio < 1.5f || newRatio > 3.0f) {
      _srv.send(400, "text/plain", "Ratio out of safe range (1.5-3.0)");
      return;
    }

    bat_set_ratio(newRatio);

    StaticJsonDocument<128> doc;
    doc["status"]   = "ok";
    doc["ratio"]    = newRatio;
    doc["batV"]     = bat_voltage();
    String out; serializeJson(doc, out);
    _srv.send(200, "application/json", out);
    return;
  }

  _srv.send(405, "text/plain", "Method not allowed");
}

// ─── /api/alerts  GET/POST — настройки Telegram-алертов (v5.0.20) ───────
// GET  → возвращает текущие пороги {batLowV, tempLow, tempHigh, rtcEn}
// POST → сохраняет {batLowV, tempLow, tempHigh, rtcEn} в EEPROM
static void _handleAlerts() {
  if (!_auth()) return;
  _activity();

  if (_srv.method() == HTTP_GET) {
    AlertSettings a; load_alerts(a);
    StaticJsonDocument<160> doc;
    doc["batLowV"]  = a.batLowV;
    doc["tempLow"]  = a.tempLow;
    doc["tempHigh"] = a.tempHigh;
    doc["rtcEn"]    = a.rtcEn;
    String out; serializeJson(doc, out);
    _srv.send(200, "application/json", out);
    return;
  }

  if (_srv.method() == HTTP_POST) {
    if (!_csrf_check()) return;
    if (!_srv.hasArg("plain")) { _srv.send(400, "text/plain", "No body"); return; }

    StaticJsonDocument<192> in;
    DeserializationError err = deserializeJson(in, _srv.arg("plain"));
    if (err) { _srv.send(400, "text/plain", "Bad JSON"); return; }

    AlertSettings a; load_alerts(a);  // начинаем с текущих значений
    if (in.containsKey("batLowV"))  a.batLowV  = in["batLowV"].as<float>();
    if (in.containsKey("tempLow"))  a.tempLow  = in["tempLow"].as<float>();
    if (in.containsKey("tempHigh")) a.tempHigh = in["tempHigh"].as<float>();
    if (in.containsKey("rtcEn"))    a.rtcEn    = in["rtcEn"].as<bool>();

    // Валидация
    if (isnan(a.batLowV)  || a.batLowV  < 0.0f   || a.batLowV  > 5.0f)  { _srv.send(400, "text/plain", "batLowV out of range (0..5)"); return; }
    if (isnan(a.tempLow)  || a.tempLow  < -55.0f || a.tempLow  > 85.0f) { _srv.send(400, "text/plain", "tempLow out of range"); return; }
    if (isnan(a.tempHigh) || a.tempHigh < -55.0f || a.tempHigh > 85.0f) { _srv.send(400, "text/plain", "tempHigh out of range"); return; }

    save_alerts(a);
    StaticJsonDocument<160> doc;
    doc["status"]   = "ok";
    doc["batLowV"]  = a.batLowV;
    doc["tempLow"]  = a.tempLow;
    doc["tempHigh"] = a.tempHigh;
    doc["rtcEn"]    = a.rtcEn;
    String out; serializeJson(doc, out);
    _srv.send(200, "application/json", out);
    return;
  }

  _srv.send(405, "text/plain", "Method not allowed");
}

// ─── /api/daystat  GET — суточная статистика (фичи 12, 17) ──────────────
static void _handleDayStat() {
  if (!_auth()) return;
  _keepalive();  // GET-поллинг — не сбрасывать подсветку
  // Дата из параметра или текущая из RTC
  String date = _srv.arg("date");
  // Санитизация: только цифры, '-' и '.', длина ≤10 (защита от инъекций)
  if (date.length() > 0) {
    if (date.length() > 10) date = date.substring(0, 10);
    for (unsigned int i = 0; i < date.length(); i++) {
      char ch = date[i];
      if (!isdigit(ch) && ch != '-' && ch != '.') {
        _srv.send(400, "text/plain", "Bad date");
        return;
      }
    }
  }
  if (date.length() == 0) date = *_wd.datetime;  // "DD.MM.YYYY HH:MM:SS" → берём первые 10
  if (date.length() > 10) date = date.substring(0, 10);
  if (date.length() < 10) {
    _sendJson(false, "Дата недоступна");
    return;
  }
  // Нормализация: YYYY-MM-DD → DD.MM.YYYY (единый формат для season/days/log_day_stat)
  if (date.length() == 10 && date.charAt(4) == '-') {
    // "YYYY-MM-DD" → "DD.MM.YYYY"
    date = date.substring(8, 10) + "." + date.substring(5, 7) + "." + date.substring(0, 4);
  }

  DayStat ds = log_day_stat(date);

  StaticJsonDocument<256> doc;
  doc["date"]   = date;
  doc["valid"]  = ds.valid;
  doc["wMin"]   = ds.valid ? ds.wMin : 0;
  doc["wMax"]   = ds.valid ? ds.wMax : 0;
  doc["tMin"]   = (ds.valid && ds.tMin < 1e8f) ? ds.tMin : (float)NAN;
  doc["tMax"]   = (ds.valid && ds.tMax > -1e8f) ? ds.tMax : (float)NAN;
  doc["count"]  = ds.count;

  // Фича 17: информация об улье
  // Сезон по месяцу (date уже нормализован к DD.MM.YYYY)
  int month = 0;
  if (date.length() >= 7) month = date.substring(3, 5).toInt();
  const char* season =
    (month >= 3 && month <= 5)  ? "Vesna" :
    (month >= 6 && month <= 8)  ? "Leto"  :
    (month >= 9 && month <= 11) ? "Osen"  : "Zima";
  doc["season"] = season;

  // Дней наблюдений: разница между текущей и первой датой лога
  // Обе даты в формате DD.MM.YYYY после нормализации
  {
    char firstDate[12];
    int days = 0;
    if (log_first_date(firstDate, sizeof(firstDate)) && date.length() >= 10) {
      int d1 = atoi(firstDate);      int m1 = atoi(firstDate + 3);  int y1 = atoi(firstDate + 6);
      int d2 = atoi(date.c_str());   int m2 = atoi(date.c_str()+3); int y2 = atoi(date.c_str()+6);
      long e1 = (long)y1*365 + y1/4 - y1/100 + y1/400 + (m1*306+5)/10 + d1;
      long e2 = (long)y2*365 + y2/4 - y2/100 + y2/400 + (m2*306+5)/10 + d2;
      days = (int)(e2 - e1);
      if (days < 0) days = 0;
    }
    doc["daysSinceStart"] = days > 0 ? days : (log_size() > 100 ? 1 : 0);
  }

  // Последнее значительное изменение — дельта текущий - опорный
  doc["deltaKg"] = *_wd.weight - *_wd.prevWeight;

  String out; serializeJson(doc, out);
  _srv.send(200, "application/json", out);
}

// ─── /api/log/clear  POST — очистить лог ─────────────────────────────────
static void _handleLogClear() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  _activity();
  log_clear();
  _sendJson(true, "Лог очищен");
}

// ─── /api/log/json  GET — лог в JSON ─────────────────────────────────────
// Стримит прямо в HTTP-ответ через ChunkStream — без аккумуляции 4КБ String в heap.
static void _handleLogJson() {
  if (!_auth()) return;
  static unsigned long _lastLogReq = 0;
  if (!_rate_limit(_lastLogReq, 1000UL)) return;
  _keepalive();
  _srv.setContentLength(CONTENT_LENGTH_UNKNOWN);
  _srv.send(200, "application/json", "");
  class JsonChunkStream : public Stream {
  public:
    WebServerCompat &srv;
    char buf[128];
    uint16_t pos;
    JsonChunkStream(WebServerCompat &s) : srv(s), pos(0) {}
    size_t write(uint8_t c) override {
      buf[pos++] = (char)c;
      if (pos >= sizeof(buf)) flush_buf();
      return 1;
    }
    size_t write(const uint8_t *b, size_t s) override {
      for (size_t i = 0; i < s; i++) write(b[i]);
      return s;
    }
    void flush_buf() { if (pos > 0) { srv.sendContent(buf, pos); pos = 0; } }
    int available() override { return 0; }
    int read() override { return -1; }
    int peek() override { return -1; }
    void flush() override { flush_buf(); }
  } cs(_srv);
  log_stream_json(cs, 50);
  cs.flush();
}

